[
    {
        "questionNo": 0,
        "questionText": "A company is using the AWS Directory Service to integrate their on-premises Microsoft Active Directory (AD) domain with their Amazon EC2 instances via an AD connector. The below identity-based policy is attached to the IAM Identities that use the AWS Directory service:\n\n\n\n\n{\n \"Version\":\"2012-10-17\",\n \"Statement\":[\n  {\n   \"Sid\":\"DirectoryTutorialsDojo1234\",\n   \"Effect\":\"Allow\",\n   \"Action\":[\n    \"ds:*\"\n   ],\n   \"Resource\":\"arn:aws:ds:us-east-1:987654321012:directory/d-1234567890\"\n  },\n  {\n   \"Effect\":\"Allow\",\n   \"Action\":[\n   \"ec2:*\"\n   ],\n   \"Resource\":\"*\"\n  }\n ]\n}\n\n\n\n\nWhich of the following BEST describes what the above resource policy does?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAllows all AWS Directory Service (ds) calls as long as the resource contains the directory name of: DirectoryTutorialsDojo1234"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAllows all AWS Directory Service (ds) calls as long as the resource contains the directory ID: DirectoryTutorialsDojo1234"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAllows all AWS Directory Service (ds) calls as long as the resource contains the directory ID:  987654321012"
            },
            {
                "isCorrect": true,
                "text": "​\n\nAllows all AWS Directory Service (ds) calls as long as the resource contains the directory ID: d-1234567890\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>AWS Directory Service provides multiple ways to use Amazon Cloud Directory and Microsoft Active Directory (AD) with other AWS services. Directories store information about users, groups, and devices, and administrators use them to manage access to information and resources. AWS Directory Service provides multiple directory choices for customers who want to use existing Microsoft AD or Lightweight Directory Access Protocol (LDAP)–aware applications in the cloud. It also offers those same choices to developers who need a directory to manage users, groups, devices, and access.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/Products/product-name/diagrams/directory_service_howitworks.80bfccbf2f5d1d63558ec3c086aff247147258f1.png\"></p><p><br></p><p>Every AWS resource is owned by an AWS account, and permissions to create or access the resources are governed by permissions policies. An account administrator can attach permissions policies to IAM identities (that is, users, groups, and roles), and some services (such as AWS Lambda) also support attaching permissions policies to resources.</p><p>The following resource policy example allows all <code>ds</code> calls as long as the resource contains the directory ID \"<code>d-1234567890</code>\".</p><pre class=\"prettyprint linenums\">{\n \"Version\":\"2012-10-17\",\n \"Statement\":[\n    {\n        \"Sid\":\"VisualEditor0\",\n        \"Effect\":\"Allow\",\n        \"Action\":[\n            \"ds:*\"\n         ],\n                 \"Resource\":\"arn:aws:ds:us-east-1:123456789012:directory/d-1234567890\"\n    },\n    {\n    \"Effect\":\"Allow\",\n    \"Action\":[\n        \"ec2:*\"\n    ],\n    \"Resource\":\"*\"\n    }\n  ]\n}</pre><p><br></p><p>Hence, the correct answer is the option that says: <strong>Allows all AWS Directory Service </strong><code><strong>(ds)</strong></code><strong> calls as long as the resource contains the directory ID: </strong><code><strong>d-1234567890</strong></code>.</p><p>The option that says: <strong>Allows all AWS Directory Service </strong><code><strong>(ds)</strong></code><strong> calls as long as the resource contains the directory ID: </strong><code><strong>DirectoryTutorialsDojo1234</strong></code> is incorrect because <code>DirectoryTutorialsDojo1234</code> is the Statement ID (SID) and not the Directory ID.</p><p>The option that says: <strong>Allows all AWS Directory Service </strong><code><strong>(ds)</strong></code><strong> calls as long as the resource contains the directory ID: </strong><code><strong>987654321012</strong></code> is incorrect because the numbers: <code>987654321012</code> is the Account ID and not the Directory ID.</p><p>The option that says: <strong>Allows all AWS Directory Service </strong><code><strong>(ds)</strong></code><strong> calls as long as the resource contains the directory name of: </strong><code><strong>DirectoryTutorialsDojo1234</strong></code> is incorrect because <code>DirectoryTutorialsDojo1234</code> is the Statement ID (SID) and not the Directory name.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/directoryservice/latest/admin-guide/IAM_Auth_Access_IdentityBased.html\">https://docs.aws.amazon.com/directoryservice/latest/admin-guide/IAM_Auth_Access_IdentityBased.html</a></p><p><a href=\"https://docs.aws.amazon.com/directoryservice/latest/admin-guide/IAM_Auth_Access_Overview.html\">https://docs.aws.amazon.com/directoryservice/latest/admin-guide/IAM_Auth_Access_Overview.html</a></p><p><br></p><p><strong>Check out this AWS Identity &amp; Access Management (IAM) Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-identity-and-access-management-iam/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-identity-and-access-management-iam/</a></p></div>"
    },
    {
        "questionNo": 1,
        "questionText": "You are working as a Solutions Architect for a leading financial firm where you are responsible in ensuring that their applications are highly available and safe from common web security vulnerabilities. Which is the most suitable AWS service to use to mitigate Distributed Denial of Service (DDoS) attacks from hitting your back-end EC2 instances?   ",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAmazon GuardDuty "
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS WAF "
            },
            {
                "isCorrect": true,
                "text": "​\n\nAWS Shield \n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS Firewall Manager "
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>AWS Shield is a managed Distributed Denial of Service (DDoS) protection service that safeguards applications running on AWS. AWS Shield provides always-on detection and automatic inline mitigations that minimize application downtime and latency, so there is no need to engage AWS Support to benefit from DDoS protection. There are two tiers of AWS Shield - Standard and Advanced.</p><p>All AWS customers benefit from the automatic protections of AWS Shield Standard, at no additional charge. AWS Shield Standard defends against most common, frequently occurring network and transport layer DDoS attacks that target your web site or applications. When you use AWS Shield Standard with Amazon CloudFront<a href=\"https://aws.amazon.com/cloudfront/\"> </a>and Amazon Route 53, you receive comprehensive availability protection against all known infrastructure (Layer 3 and 4) attacks.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/aws-answers/answers-images/non-lb-app-ddos-mitigation.379c24da557a03e2952636c214fd32be3e0d7265.png\"></p><p><br></p><p><strong>AWS WAF</strong> is incorrect because this is a web application firewall service that helps protect your web apps from common exploits that could affect app availability, compromise security, or consume excessive resources. Although this can help you against DDoS attacks, AWS WAF alone is not enough to fully protect your VPC. You still need to use AWS Shield in this scenario.</p><p><strong>AWS Firewall Manager</strong> is incorrect because this just simplifies your AWS WAF administration and maintenance tasks across multiple accounts and resources.</p><p><strong>Amazon GuardDuty</strong> is incorrect because this is just an intelligent threat detection service to protect your AWS accounts and workloads. Using this alone will not fully protect your AWS resources against DDoS attacks.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/waf/latest/developerguide/waf-which-to-choose.html\">https://docs.aws.amazon.com/waf/latest/developerguide/waf-which-to-choose.html</a></p><p><a href=\"https://aws.amazon.com/answers/networking/aws-ddos-attack-mitigation/\">https://aws.amazon.com/answers/networking/aws-ddos-attack-mitigation/</a></p><p><br></p><p><strong>Check out this AWS Shield Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-shield/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-shield/</a></p></div>"
    },
    {
        "questionNo": 2,
        "questionText": "You have a prototype web application that uses one Spot EC2 instance. What will happen to the instance by default if it gets interrupted by Amazon EC2 for capacity requirements?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nThe instance will be stopped"
            },
            {
                "isCorrect": false,
                "text": "​\nThis is not possible as only On-Demand instances can be interrupted by Amazon EC2"
            },
            {
                "isCorrect": true,
                "text": "​\nThe instance will be terminated\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nThe instance will be restarted"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>The main differences are that:</p><p>- Spot instances typically offer a significant discount off the On-Demand prices.</p><p>- Your instances can be interrupted by Amazon EC2 for capacity requirements with a 2-minute notification.</p><p>- Spot prices adjust gradually based on long term supply and demand for spare EC2 capacity.</p><p>You can choose to have your Spot instances terminated, stopped, or hibernated upon interruption. Stop and hibernate options are available for persistent Spot requests and Spot Fleets with the <strong>maintain</strong> option enabled. By default, your instances are terminated hence, the correct answer is the option that says: <strong>The instance will be terminated</strong>.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://aws.amazon.com/ec2/faqs/\">https://aws.amazon.com/ec2/faqs/</a></p><p><br></p><p><strong>Check out this Amazon EC2 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/</a></p><p><br></p><p><strong>Here is an in-depth look at Spot Instances:</strong></p><p><a href=\"https://youtu.be/PKvss-RgSjI\">https://youtu.be/PKvss-RgSjI</a></p></div>"
    },
    {
        "questionNo": 3,
        "questionText": "You are working as a Solutions Architect for a startup in which you are tasked to develop a custom messaging service that will also be used to train their AI for an automatic response feature which they plan to implement in the future. Based on their research and tests, the service can receive up to thousands of messages a day, and all of these data are to be sent to Amazon EMR for further processing. It is crucial that none of the messages will be lost, no duplicates will be produced and that they are processed in EMR in the same order as their arrival.\n\nWhich of the following options should you implement to meet the startup's requirements?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nSet up an Amazon SNS Topic to handle the messages."
            },
            {
                "isCorrect": true,
                "text": "​\n\nCreate an Amazon Kinesis Data Stream to collect the messages.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a pipeline using AWS Data Pipeline to handle the messages."
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet up a default Amazon SQS queue to handle the messages."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Two important requirements that the chosen AWS service should fulfill is that data should not go missing, is durable, and streams data in the sequence of arrival. Kinesis can do the job just fine because of its architecture. A Kinesis data stream is a set of shards that has a sequence of data records, and each data record has a sequence number that is assigned by Kinesis Data Streams. Kinesis can also easily handle the high volume of messages being sent to the service.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/Products/product-name/diagrams/product-page-diagram_Amazon-Kinesis-Data-Streams.074de94302fd60948e1ad070e425eeda73d350e7.png\"><br><br>Amazon Kinesis Data Streams enables real-time processing of streaming big data. It provides ordering of records, as well as the ability to read and/or replay records in the same order to multiple Amazon Kinesis Applications. The Amazon Kinesis Client Library (KCL) delivers all records for a given partition key to the same record processor, making it easier to build multiple applications reading from the same Amazon Kinesis data stream (for example, to perform counting, aggregation, and filtering).</p><p><strong>Setting up a default Amazon SQS queue to handle the messages</strong> is incorrect because although SQS is a valid messaging service, it is not suitable for scenarios where you need to process the data based on the order they were received. Take note that a default queue in SQS is just a standard queue and not a FIFO (First-In-First-Out) queue. In addition, SQS does not guarantee that no duplicates will be sent.</p><p><strong>Setting up an Amazon SNS Topic to handle the messages</strong> is incorrect because SNS is a pub-sub messaging service in AWS. SNS might not be capable of handling such a large volume of messages being received and sent at a time. It does not also guarantee that the data will be transmitted in the same order they were received.</p><p><strong>Creating a pipeline using AWS Data Pipeline to handle the messages</strong> is incorrect because this is primarily used as a cloud-based data workflow service that helps you process and move data between different AWS services and on-premises data sources. It is not suitable for collecting data from distributed sources such as users, IoT devices, or clickstreams.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/streams/latest/dev/introduction.html\">https://docs.aws.amazon.com/streams/latest/dev/introduction.html</a></p><p><br></p><p>For additional information, read the <strong><em>When should I use Amazon Kinesis Data Streams, and when should I use Amazon SQS?</em></strong> section of the Kinesis Data Stream FAQ:</p><p><a href=\"https://aws.amazon.com/kinesis/data-streams/faqs/\">https://aws.amazon.com/kinesis/data-streams/faqs/</a></p><p><br></p><p><strong>Check out this Amazon Kinesis Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-kinesis/?src=udemy\">https://tutorialsdojo.com/amazon-kinesis/</a></p></div>"
    },
    {
        "questionNo": 4,
        "questionText": "An auto-scaling group of Linux EC2 instances is created with basic monitoring enabled in CloudWatch. You noticed that your application is slow so you asked one of your engineers to check all of your EC2 instances. After checking your instances, you noticed that the auto scaling group is not launching more instances as it should be, even though the servers already have high memory usage.\n\nWhich of the following are possible solutions that an Architect can implement to solve this issue? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nEnable detailed monitoring on the instances."
            },
            {
                "isCorrect": true,
                "text": "​\n\nInstall the CloudWatch agent to the EC2 instances which will trigger your Auto Scaling group to scale up.\n\n(Correct)"
            },
            {
                "isCorrect": true,
                "text": "​\n\nInstall CloudWatch monitoring scripts in the instances. Send custom metrics to CloudWatch which will trigger your Auto Scaling group to scale up.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nInstall AWS SDK in the EC2 instances. Create a script that will trigger the Auto Scaling event if there is a high memory usage."
            },
            {
                "isCorrect": false,
                "text": "​\n\nModify the scaling policy to increase the threshold to scale up the number of instances."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>The Amazon CloudWatch Monitoring Scripts for Amazon Elastic Compute Cloud (Amazon EC2) Linux-based instances demonstrate how to produce and consume Amazon CloudWatch custom metrics. These sample Perl scripts comprise a fully functional example that reports memory, swap, and disk space utilization metrics for a Linux instance.</p><p>&nbsp;</p><p><img src=\"https://docs.aws.amazon.com/elasticbeanstalk/latest/dg/images/aeb-container-cw.png\"></p><p>&nbsp;</p><p>The premise of the scenario is that the EC2 servers have <strong>high memory</strong> usage, but since this specific metric is not tracked by the Auto Scaling group by default, the scaling up activity is not being triggered. Remember that by default, CloudWatch doesn't monitor memory usage but only the CPU utilization, Network utilization, Disk performance and Disk Reads/Writes.</p><p>This is the reason why you have to install CloudWatch Monitoring Scripts in your EC2 instances to collect and monitor the custom metric (memory usage), which will be used by your Auto Scaling Group as a trigger for scaling activities.</p><p>CloudWatch does not monitor EC2 memory usage as well as disk space utilization. You would have to collect the metrics using a script or by using a CloudWatch agent then send the data to CloudWatch. Hence, the correct answers are:</p><p><strong><em>&nbsp;- Install CloudWatch monitoring scripts in the instances. Send custom metrics to CloudWatch which will trigger your Auto Scaling group to scale up.</em></strong></p><p><strong><em>- Install the CloudWatch agent to the EC2 instances which will trigger your Auto Scaling group to scale up. </em></strong></p><p>&nbsp;</p><p>The option that says:&nbsp;<strong><em>Install AWS SDK in the EC2 instances. Create a script that will trigger the Auto Scaling event if there is a high memory usage</em></strong><em> </em>is incorrect because AWS SDK is a set of programming tools that allow you to create applications that run using Amazon cloud services. You would have to program the alert which is not the best strategy for this scenario.</p><p>The option that says:&nbsp;<strong><em>Enable detailed monitoring on the instances</em></strong> is incorrect because detailed monitoring does not provide metrics for memory usage. CloudWatch does not monitor memory usage in its default set of EC2 metrics and detailed monitoring just provides a higher frequency of metrics (1-minute frequency).</p><p>The option that says:&nbsp;<strong><em>Modify the scaling policy to increase the threshold to scale up the number of instances</em></strong> is incorrect because you are already maxing out your usage, which should in effect cause an auto-scaling event.</p><p>&nbsp;</p><p><strong>References: </strong></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/mon-scripts.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/mon-scripts.html</a> <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/viewing_metrics_with_cloudwatch.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/viewing_metrics_with_cloudwatch.html</a></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitoring_ec2.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitoring_ec2.html</a></p><p>&nbsp;</p><p><strong>Check out this Amazon EC2 and CloudWatch Cheat Sheets:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/</a></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/</a></p></div>"
    },
    {
        "questionNo": 5,
        "questionText": "You are using an On-Demand EC2 instance to host a legacy web application that uses an Amazon Instance Store-Backed AMI. The web application should be decommissioned as soon as possible and hence, you need to terminate the EC2 instance.\n\nWhen the instance is terminated, what happens to the data on the root volume?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nData is automatically saved as an EBS volume."
            },
            {
                "isCorrect": false,
                "text": "​\nData is automatically saved as an EBS snapshot."
            },
            {
                "isCorrect": true,
                "text": "​\nData is automatically deleted.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nData is unavailable until the instance is restarted."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>AMIs are categorized as either <em>backed by Amazon EBS</em> or <em>backed by instance store</em>. The former means that the root device for an instance launched from the AMI is an Amazon EBS volume created from an Amazon EBS snapshot. The latter means that the root device for an instance launched from the AMI is an instance store volume created from a template stored in Amazon S3.</p><p>The option that says: <strong>Data is automatically deleted</strong> is the correct answer because the data on instance store volumes persist only during the life of the instance which means that if the instance is terminated, the data will be automatically deleted.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ComponentsAMIs.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ComponentsAMIs.html</a></p></div>"
    },
    {
        "questionNo": 6,
        "questionText": "You are employed by a large electronics company that uses Amazon Simple Storage Service. For reporting purposes, they want to track and log every request access to their S3 buckets including the requester, bucket name, request time, request action, referrer, turnaround time, and error code information. The solution should also provide more visibility into the object-level operations of the bucket.\n\nWhich is the best solution among the following options that can satisfy the requirement?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nEnable the Requester Pays option to track access via AWS Billing."
            },
            {
                "isCorrect": true,
                "text": "​\nEnable server access logging for all required Amazon S3 buckets.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nEnable Amazon S3 Event Notifications for PUT and POST."
            },
            {
                "isCorrect": false,
                "text": "​\nEnable AWS CloudTrail to audit all Amazon S3 bucket access."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can use AWS CloudTrail logs together with server access logs for Amazon S3. CloudTrail logs provide you with detailed API tracking for Amazon S3 bucket-level and object-level operations, while server access logs for Amazon S3 provide you visibility into object-level operations on your data in Amazon S3.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AmazonS3/latest/user-guide/images/bucket-logging-box.png\"></p><p><br></p><p>You can also use CloudTrail logs together with CloudWatch for Amazon S3. CloudTrail integration with CloudWatch Logs delivers S3 bucket-level API activity captured by CloudTrail to a CloudWatch log stream in the CloudWatch log group you specify. You can create CloudWatch alarms for monitoring specific API activity and receive email notifications when the specific API activity occurs</p><p>For this scenario, you can use CloudTrail and the Server Access Logging feature of Amazon S3. However, the question mentioned that it needs detailed information about every access request sent to the S3 bucket including the referrer and turn-around time information. These two records are not available in CloudTrail which is why the correct answer is to <strong>enable server access logging for all required Amazon S3 buckets</strong>.</p><p><strong>Enabling the Requester Pays option to track access via AWS Billing</strong> is incorrect because this action refers to AWS billing and not for logging.</p><p><strong>Enabling Amazon S3 Event Notifications for PUT and POST</strong> is incorrect because we are looking for a logging solution and not an event notification.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/cloudtrail-logging.html#cloudtrail-logging-vs-server-logs\">https://docs.aws.amazon.com/AmazonS3/latest/dev/cloudtrail-logging.html#cloudtrail-logging-vs-server-logs</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/LogFormat.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/LogFormat.html</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/ServerLogs.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/ServerLogs.html</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-</a><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/?src=udemy\">amazon-s3</a><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">/</a></p></div>"
    },
    {
        "questionNo": 7,
        "questionText": "A company is looking to store their confidential financial files in AWS which are accessed every week. The Architect was instructed to set up the storage system which uses envelope encryption and automates key rotation. It should also provide an audit trail which shows who used the encryption key and by whom for security purposes.\n\nWhich of the following should the Architect implement to satisfy the requirement in the most cost-effective way? (Select TWO.)",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nUse Amazon S3 to store the data.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon Certificate Manager"
            },
            {
                "isCorrect": true,
                "text": "​\n\nConfigure Server-Side Encryption with AWS KMS-Managed Keys (SSE-KMS).\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nConfigure Server-Side Encryption with Amazon S3-Managed Keys (SSE-S3)."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse Amazon S3 Glacier Deep Archive to store the data."
            },
            {
                "isCorrect": false,
                "text": "​\n\nConfigure Server-Side Encryption with Customer-Provided Keys (SSE-C)."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Server-side encryption is the encryption of data at its destination by the application or service that receives it. AWS Key Management Service (AWS KMS) is a service that combines secure, highly available hardware and software to provide a key management system scaled for the cloud. Amazon S3 uses AWS KMS customer master keys (CMKs) to encrypt your Amazon S3 objects. SSE-KMS encrypts only the object data. Any object metadata is not encrypted. If you use customer-managed CMKs, you use AWS KMS via the AWS Management Console or AWS KMS APIs to centrally create encryption keys, define the policies that control how keys can be used, and audit key usage to prove that they are being used correctly. You can use these keys to protect your data in Amazon S3 buckets.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/kms/latest/developerguide/images/key-hierarchy-cmk.png\"></p><p><br></p><p>A customer master key (CMK) is a logical representation of a master key. The CMK includes metadata, such as the key ID, creation date, description, and key state. The CMK also contains the key material used to encrypt and decrypt data. You can use a CMK to encrypt and decrypt up to 4 KB (4096 bytes) of data. Typically, you use CMKs to generate, encrypt, and decrypt the data keys that you use outside of AWS KMS to encrypt your data. This strategy is known as <strong>envelope encryption.</strong></p><p>You have three mutually exclusive options depending on how you choose to manage the encryption keys:</p><p><strong>Use Server-Side Encryption with Amazon S3-Managed Keys (SSE-S3)</strong> – Each object is encrypted with a unique key. As an additional safeguard, it encrypts the key itself with a master key that it regularly rotates. Amazon S3 server-side encryption uses one of the strongest block ciphers available, 256-bit Advanced Encryption Standard (AES-256), to encrypt your data.</p><p><strong>Use Server-Side Encryption with Customer Master Keys (CMKs) Stored in AWS Key Management Service (SSE-KMS)</strong> – Similar to SSE-S3, but with some additional benefits and charges for using this service. There are separate permissions for the use of a CMK that provides added protection against unauthorized access of your objects in Amazon S3. SSE-KMS also provides you with an audit trail that shows when your CMK was used and by whom. Additionally, you can create and manage customer-managed CMKs or use AWS managed CMKs that are unique to you, your service, and your Region.</p><p><strong>Use Server-Side Encryption with Customer-Provided Keys (SSE-C)</strong> – You manage the encryption keys and Amazon S3 manages the encryption, as it writes to disks, and decryption when you access your objects.</p><p>In the scenario, the company needs to store financial files in AWS which are accessed every week and the solution should use envelope encryption. This requirement can be fulfilled by using an Amazon S3 configured with Server-Side Encryption with AWS KMS-Managed Keys (SSE-KMS). Hence, <strong>using Amazon S3 to store the data</strong> and <strong>configuring Server-Side Encryption with AWS KMS-Managed Keys (SSE-KMS)</strong> are the correct answers.</p><p><strong>Using Amazon S3 Glacier Deep Archive to store the data</strong> is incorrect because although this provides the most cost-effective storage solution, it is not the appropriate service to use if the files being stored are frequently accessed every week.</p><p><strong>Configuring Server-Side Encryption with Customer-Provided Keys (SSE-C)</strong> and <strong>configuring Server-Side Encryption with Amazon S3-Managed Keys (SSE-S3)</strong> are incorrect because although you can configure automatic key rotation, these two do not provide you with an audit trail that shows when your CMK was used and by whom, unlike Server-Side Encryption with AWS KMS-Managed Keys (SSE-KMS).</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/serv-side-encryption.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/serv-side-encryption.html</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/UsingKMSEncryption.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/UsingKMSEncryption.html</a></p><p><a href=\"https://docs.aws.amazon.com/kms/latest/developerguide/services-s3.html\">https://docs.aws.amazon.com/kms/latest/developerguide/services-s3.html</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p></div>"
    },
    {
        "questionNo": 8,
        "questionText": "A customer is transitioning their ActiveMQ messaging broker service onto the AWS cloud in which they require an alternative asynchronous service that supports NMS and MQTT messaging protocol. The customer does not have the time and resources needed to recreate their messaging service in the cloud. The service has to be highly available and should require almost no management overhead.\n\nWhich of the following is the most suitable service to use to meet the above requirement?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SQS"
            },
            {
                "isCorrect": true,
                "text": "​\n\nAmazon MQ\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SNS"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SWF"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>Amazon MQ</strong> is a managed message broker service for Apache ActiveMQ that makes it easy to set up and operate message brokers in the cloud. Connecting your current applications to Amazon MQ is easy because it uses industry-standard APIs and protocols for messaging, including JMS, NMS, AMQP, STOMP, MQTT, and WebSocket. Using standards means that in most cases, there’s no need to rewrite any messaging code when you migrate to AWS.</p><p>Amazon MQ, Amazon SQS, and Amazon SNS are messaging services that are suitable for anyone from startups to enterprises. If you're using messaging with existing applications and want to move your messaging service to the cloud quickly and easily, it is recommended that you consider Amazon MQ. It supports industry-standard APIs and protocols so you can switch from any standards-based message broker to Amazon MQ without rewriting the messaging code in your applications.</p><p><br></p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/1b6453892473a467d07372d45eb05abc2031647a/2018/01/30/reference_diagram_resized.png\"></p><p><br></p><p>If you are building brand new applications in the cloud, then it is highly recommended that you consider Amazon SQS and Amazon SNS. Amazon SQS and SNS are lightweight, fully managed message queue and topic services that scale almost infinitely and provide simple, easy-to-use APIs. You can use Amazon SQS and SNS to decouple and scale microservices, distributed systems, and serverless applications, and improve reliability.</p><p>Hence, <strong>Amazon MQ</strong> is the correct answer.</p><p><strong>Amazon SNS</strong> is incorrect because this is more suitable as a pub/sub messaging service instead of a message broker service.</p><p><strong>Amazon SQS</strong> is incorrect because although this is a fully managed message queuing service, it does not support an extensive list of industry-standard messaging APIs and protocol, unlike Amazon MQ. Moreover, using Amazon SQS requires you to do additional changes in the messaging code of applications to make it compatible.</p><p><strong>Amazon SWF</strong> is incorrect because this is a fully-managed state tracker and task coordinator service and not a messaging service, unlike Amazon MQ, AmazonSQS, and Amazon SNS.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/amazon-mq/\">https://aws.amazon.com/amazon-mq/</a></p><p><a href=\"https://aws.amazon.com/messaging/\">https://aws.amazon.com/messaging/</a></p><p><a href=\"https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/welcome.html#sqs-difference-from-amazon-mq-sns\">https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/welcome.html#sqs-difference-from-amazon-mq-sns</a></p><p><br></p><p><strong>Check out this Amazon MQ Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-mq/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-mq/</a></p></div>"
    },
    {
        "questionNo": 9,
        "questionText": "A web application is hosted in an Auto Scaling group of EC2 instances deployed across multiple Availability Zones behind an Application Load Balancer. You need to implement an SSL solution for your system to improve its security which is why you requested an SSL/TLS certificate from a third-party certificate authority (CA).\n\nWhere can you safely import the SSL/TLS certificate of your application? (Select TWO.)",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nAWS Certificate Manager\n\n(Correct)"
            },
            {
                "isCorrect": true,
                "text": "​\n\nIAM certificate store\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAn S3 bucket configured with server-side encryption with customer-provided encryption keys (SSE-C)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCloudFront"
            },
            {
                "isCorrect": false,
                "text": "​\n\nA private S3 bucket with versioning enabled"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>If you got your certificate from a third-party CA, import the certificate into ACM or upload it to the IAM certificate store. Hence, <strong>AWS Certificate Manager</strong> and <strong>IAM certificate store</strong> are the correct answers.</p><p><br></p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/22d200f8670dbdb3e253a90eee5098477c95c23d/2016/10/11/image1_numbereddiagram_b.png\"></p><p><br></p><p>ACM lets you import third-party certificates from the ACM console, as well as programmatically. If ACM is not available in your region, use AWS CLI to upload your third-party certificate to the IAM certificate store.</p><p><strong>A private S3 bucket with versioning enabled</strong> and <strong>an S3 bucket configured with server-side encryption with customer-provided encryption keys (SSE-C)</strong> are both incorrect as S3 is not a suitable service to store the SSL certificate.</p><p><strong>CloudFront</strong> is incorrect because although you can upload certificates to CloudFront, it doesn't mean that you can import SSL certificates on it. You would not be able to export the certificate that you have loaded in CloudFront nor assign them to your EC2 or ELB instances as it would be tied to a single CloudFront distribution.</p><p><br></p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/cnames-and-https-procedures.html#cnames-and-https-uploading-certificates\">https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/cnames-and-https-procedures.html#cnames-and-https-uploading-certificates</a></p><p><br></p><p><strong>Check out this Amazon CloudFront Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-cloudfront/?src=udemy\">https://tutorialsdojo.com/amazon-cloudfront/</a></p><p><br></p><p><strong>Tutorials Dojo's AWS Certified Solutions Architect Associate Exam Study Guide:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-certified-solutions-architect-associate-saa-c02/?src=udemy\">https://tutorialsdojo.com/aws-certified-solutions-architect-associate-saa-c02/</a></p></div>"
    },
    {
        "questionNo": 10,
        "questionText": "A company has a High Performance Computing (HPC) cluster that is composed of EC2 Instances with Provisioned IOPS volume to process transaction-intensive, low-latency workloads. The Solutions Architect must maintain high IOPS while keeping the latency down by setting the optimal queue length for the volume. The size of each volume is 10 GiB.\n\nWhich of the following is the MOST suitable configuration that the Architect should set up?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nSet the IOPS to 500 then maintain a low queue length.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet the IOPS to 600 then maintain a high queue length."
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet the IOPS to 800 then maintain a low queue length."
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet the IOPS to 400 then maintain a low queue length."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Provisioned IOPS SSD (<code>io1</code>) volumes are designed to meet the needs of I/O-intensive workloads, particularly database workloads, that are sensitive to storage performance and consistency. Unlike <code>gp2</code>, which uses a bucket and credit model to calculate performance, an <code>io1</code> volume allows you to specify a consistent IOPS rate when you create the volume, and Amazon EBS delivers within 10 percent of the provisioned IOPS performance 99.9 percent of the time over a given year.</p><p>An <code>io1</code> volume can range in size from 4 GiB to 16 TiB. You can provision from 100 IOPS up to 64,000 IOPS per volume on <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/instance-types.html#ec2-nitro-instances\">Nitro system</a> instance families and up to 32,000 on other instance families. The maximum ratio of provisioned IOPS to requested volume size (in GiB) is 50:1.</p><p>For example, a 100 GiB volume can be provisioned with up to 5,000 IOPS. On a supported instance type, any volume 1,280 GiB in size or greater allows provisioning up to the 64,000 IOPS maximum (50 × 1,280 GiB = 64,000).</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/images/io1_throughput.png\"></p><p><br></p><p>An <code>io1</code> volume provisioned with up to 32,000 IOPS supports a maximum I/O size of 256 KiB and yields as much as 500 MiB/s of throughput. With the I/O size at the maximum, peak throughput is reached at 2,000 IOPS. A volume provisioned with more than 32,000 IOPS (up to the cap of 64,000 IOPS) supports a maximum I/O size of 16 KiB and yields as much as 1,000 MiB/s of throughput.</p><p>The volume queue length is the number of pending I/O requests for a device. Latency is the true end-to-end client time of an I/O operation, in other words, the time elapsed between sending an I/O to EBS and receiving an acknowledgement from EBS that the I/O read or write is complete. Queue length must be correctly calibrated with I/O size and latency to avoid creating bottlenecks either on the guest operating system or on the network link to EBS.</p><p>Optimal queue length varies for each workload, depending on your particular application's sensitivity to IOPS and latency. If your workload is not delivering enough I/O requests to fully use the performance available to your EBS volume then your volume might not deliver the IOPS or throughput that you have provisioned.</p><p>Transaction-intensive applications are sensitive to increased I/O latency and are well-suited for SSD-backed <code>io1</code> and <code>gp2</code> volumes. You can maintain high IOPS while keeping latency down by maintaining a low queue length and a high number of IOPS available to the volume. Consistently driving more IOPS to a volume than it has available can cause increased I/O latency.</p><p>Throughput-intensive applications are less sensitive to increased I/O latency, and are well-suited for HDD-backed <code>st1</code> and <code>sc1</code> volumes. You can maintain high throughput to HDD-backed volumes by maintaining a high queue length when performing large, sequential I/O.</p><p>Therefore, for instance, a 10 GiB volume can be provisioned with up to <strong>500</strong> IOPS. Any volume 640 GiB in size or greater allows provisioning up to a maximum of 32,000 IOPS (50 × 640 GiB = 32,000). Hence, the correct answer is to <strong>set the IOPS to 500 then maintain a low queue length</strong>.</p><p><strong>Setting the IOPS to 400 then maintaining a low queue length</strong> is incorrect because although a value of 400 is an acceptable value, it is not the maximum value for the IOPS. You will not fully utilize the available IOPS that the volume can offer if you just set it to 400.</p><p>The options that say: <strong>Set the IOPS to 600 then maintain a high queue length</strong> and <strong>Set the IOPS to 800 then maintain a low queue length</strong> are both incorrect because the maximum IOPS for the 10 GiB volume is only 500. Therefore, any value greater than the maximum amount, such as 600 or 800, is wrong. Moreover, you should keep the latency down by maintaining a low queue length, and not higher.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EBSVolumeTypes.html\">http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EBSVolumeTypes.html</a></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-io-characteristics.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-io-characteristics.html</a></p><p><br></p><p><strong>Check out this Amazon EBS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-ebs/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-ebs/</a></p></div>"
    },
    {
        "questionNo": 11,
        "questionText": "You have a web-based order processing system which is currently using a standard queue in Amazon SQS. The support team noticed that there are a lot of cases where an order was processed twice. This issue has caused a lot of trouble in your processing and made your customers very unhappy. Your IT Manager has asked you to ensure that this issue will not recur.\n\nWhat can you do to prevent this from happening again in the future? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAlter the retention period in Amazon SQS."
            },
            {
                "isCorrect": true,
                "text": "​\n\nUse an Amazon SQS FIFO Queue instead.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nChange the message size in SQS."
            },
            {
                "isCorrect": false,
                "text": "​\n\nAlter the visibility timeout of SQS."
            },
            {
                "isCorrect": true,
                "text": "​\n\nReplace Amazon SQS and instead, use Amazon Simple Workflow service.\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon SQS FIFO (First-In-First-Out) Queues have all the capabilities of the standard queue with additional capabilities designed to enhance messaging between applications when the order of operations and events is critical, or where <strong>duplicates can't be tolerated</strong>, for example:</p><p>- Ensure that user-entered commands are executed in the right order. <br>- Display the correct product price by sending price modifications in the right order.<br>- Prevent a student from enrolling in a course before registering for an account.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2020-03-09_11-14-42-e24d31f607e373f989c2829e2805b01e.png\"></p><p><br></p><p>Amazon SWF provides useful guarantees around task assignments. It ensures that a task is never duplicated and is assigned only once. Thus, even though you may have multiple workers for a particular activity type (or a number of instances of a decider), Amazon SWF will give a specific task to only one worker (or one decider instance). Additionally, Amazon SWF keeps at most one decision task outstanding at a time for a workflow execution. Thus, you can run multiple decider instances without worrying about two instances operating on the same execution simultaneously. These facilities enable you to coordinate your workflow without worrying about duplicate, lost, or conflicting tasks.</p><p>The main issue in this scenario is that the order management system produces duplicate orders at times. Since the company is using SQS, there is a possibility that a message can have a duplicate in case an EC2 instance failed to delete the already processed message. To prevent this issue from happening, you have to use Amazon Simple Workflow service instead of SQS.</p><p>Therefore, the correct answers are:</p><p><strong>- <em>Replace Amazon SQS and instead, use Amazon Simple Workflow service.</em></strong></p><p><strong><em>- Use an Amazon SQS FIFO Queue instead.</em></strong></p><p><br></p><p><strong><em>Altering the retention period in Amazon SQS</em></strong> is incorrect because the retention period simply specifies if the Amazon SQS should delete the messages that have been in a queue for a certain period of time.</p><p><strong><em>Altering the visibility timeout of SQS</em></strong> is incorrect because for standard queues, the visibility timeout isn't a guarantee against receiving a message twice. To avoid duplicate SQS messages, it is better to design your applications to be <em>idempotent</em> (they should not be affected adversely when processing the same message more than once).</p><p><strong><em>Changing the message size in SQS</em></strong> is incorrect because this is not related at all in this scenario.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/swf/faqs/\">https://aws.amazon.com/swf/faqs/</a></p><p><a href=\"https://aws.amazon.com/swf/\">https://aws.amazon.com/swf/</a></p><p><a href=\"https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/sqs-visibility-timeout.html\">https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/sqs-visibility-timeout.html</a></p><p><br></p><p><strong>Check out this Amazon SWF Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-simple-workflow-amazon-swf/\">https://tutorialsdojo.com/amazon-simple-workflow-amazon-swf/</a></p><p><br></p><p><strong>Amazon Simple Workflow (SWF) vs AWS Step Functions vs Amazon SQS:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-simple-workflow-swf-vs-aws-step-functions-vs-amazon-sqs/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-simple-workflow-swf-vs-aws-step-functions-vs-amazon-sqs/</a></p></div>"
    },
    {
        "questionNo": 12,
        "questionText": "You are working for a large bank that is developing a web application that receives large amounts of object data. They are using the data to generate a report for their stockbrokers to use on a daily basis. Unfortunately, a recent financial crisis has left the bank short on cash and cannot afford to purchase expensive storage hardware. They had resorted to use AWS instead.\n\nWhich is the best service to use in order to store a virtually unlimited amount of object data without any effort to scale when demand unexpectedly increases?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nAmazon EC2"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon S3 Glacier"
            },
            {
                "isCorrect": true,
                "text": "​\nAmazon S3\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nAmazon Import/Export"
            },
            {
                "isCorrect": false,
                "text": "​\nDynamoDB"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>In this scenario, you can use Amazon S3 and Amazon S3 Glacier as a storage service. And since we are looking for the best option, we have to consider that the object data being stored by the bank is used on a daily basis as well. Hence, Amazon S3 is the better choice as it provides frequent access to your object data.</p><p>Amazon S3 is a durable, secure, simple, and fast storage service designed to make web-scale computing easier for developers. Use Amazon S3 if you need low latency or frequent access to your data. Use Amazon S3 Glacier if low storage cost is paramount, and you do not require millisecond access to your data.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"http://docs.aws.amazon.com/AmazonS3/latest/dev/Welcome.html\">http://docs.aws.amazon.com/AmazonS3/latest/dev/Welcome.html</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p></div>"
    },
    {
        "questionNo": 13,
        "questionText": "A company has an OLTP (Online Transactional Processing) application that is hosted in an Amazon ECS cluster using the Fargate launch type. It has an Amazon RDS database that stores data of its production website. The Data Analytics team needs to run queries against the database to track and audit all user transactions. These query operations against the production database must not impact application performance in any way.\n\nWhich of the following is the MOST suitable and cost-effective solution that you should implement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nSet up a new Amazon RDS Read Replica of the production database. Direct the Data Analytics team to query the production data from the replica.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet up a new Amazon Redshift database cluster. Migrate the product database into Redshift and allow the Data Analytics team to fetch data from it."
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet up a Multi-AZ deployments configuration of your production database in RDS. Direct the Data Analytics team to query the production data from the standby instance."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUpgrade the instance type of the RDS database to a large instance."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon RDS Read Replicas provide enhanced performance and durability for database (DB) instances. This feature makes it easy to elastically scale out beyond the capacity constraints of a single DB instance for read-heavy database workloads.</p><p>You can create one or more replicas of a given source DB Instance and serve high-volume application read traffic from multiple copies of your data, thereby increasing aggregate read throughput. Read replicas can also be promoted when needed to become standalone DB instances. Read replicas are available in Amazon RDS for MySQL, MariaDB, Oracle and PostgreSQL, as well as Amazon Aurora.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2020-01-16_09-06-35-c09d77a9e6c2998538885b574784c9df.png\"></p><p><br></p><p>You can reduce the load on your source DB instance by routing read queries from your applications to the read replica. These replicas allow you to elastically scale out beyond the capacity constraints of a single DB instance for read-heavy database workloads.</p><p>Because read replicas can be promoted to master status, they are useful as part of a sharding implementation. To shard your database, add a read replica and promote it to master status, then, from each of the resulting DB Instances, delete the data that belongs to the other shard.</p><p>Hence, the correct answer is:<strong> Set up a new Amazon RDS Read Replica of the production database. Direct the Data Analytics team to query the production data from the replica.</strong></p><p>The option that says: <strong>Set up a new Amazon Redshift database cluster. Migrate the product database into Redshift and allow the Data Analytics team to fetch data from it</strong> is incorrect because Redshift is primarily used for OLAP (Online Analytical Processing) applications and not for OLTP.</p><p>The option that says: <strong>Set up a Multi-AZ deployments configuration of your production database in RDS. Direct the Data Analytics team to query the production data from the standby instance</strong> is incorrect because you can't directly connect to the standby instance. This is only used in the event of a database failover when your primary instance encountered an outage.</p><p>The option that says: <strong>Upgrade the instance type of the RDS database to a large instance</strong> is incorrect because this entails a significant amount of cost. Moreover, the production database could still be affected by the queries done by the Data Analytics team. A better solution for this scenario is to use a Read Replica instead.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/caching/database-caching/\">https://aws.amazon.com/caching/database-caching/</a></p><p><a href=\"https://aws.amazon.com/rds/details/read-replicas/\">https://aws.amazon.com/rds/details/read-replicas/</a></p><p><a href=\"https://aws.amazon.com/elasticache/\">https://aws.amazon.com/elasticache/</a></p><p><br></p><p><strong>Check out this Amazon RDS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-relational-database-service-amazon-rds/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-relational-database-service-amazon-rds/</a></p></div>"
    },
    {
        "questionNo": 14,
        "questionText": "You are the technical lead of the Cloud Infrastructure team in your company and you were consulted by a software developer regarding the required AWS resources of the web application that he is building. He knows that an Instance Store only provides ephemeral storage where the data is automatically deleted when the instance is terminated. To ensure that the data of his web application persists, the app should be launched in an EC2 instance that has a durable, block-level storage volume attached. He knows that they need to use an EBS volume, but they are not sure what type they need to use. \n\nIn this scenario, which of the following is true about Amazon EBS volume types and their respective usage? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nReduced Redundancy Storage volumes offer consistent and low-latency performance, and are designed for I/O intensive applications such as large relational or NoSQL databases."
            },
            {
                "isCorrect": false,
                "text": "​\n\nSpot volumes provide the lowest cost per gigabyte of all EBS volume types and are ideal for workloads where data is accessed infrequently, and applications where the lowest storage cost is important."
            },
            {
                "isCorrect": true,
                "text": "​\n\nProvisioned IOPS volumes offer storage with consistent and low-latency performance, and are designed for I/O intensive applications such as large relational or NoSQL databases.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nSingle root I/O virtualization (SR-IOV) volumes are suitable for a broad range of workloads, including small to medium sized databases, development and test environments, and boot volumes."
            },
            {
                "isCorrect": true,
                "text": "​\n\nMagnetic volumes provide the lowest cost per gigabyte of all EBS volume types and are ideal for workloads where data is accessed infrequently, and applications where the lowest storage cost is important.\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>Amazon EBS</strong> provides three volume types to best meet the needs of your workloads: General Purpose (SSD), Provisioned IOPS (SSD), and Magnetic.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/images/overview_getting_started.png\"></p><p><br></p><p>General Purpose (SSD) is the new, SSD-backed, general purpose EBS volume type that we recommend as the default choice for customers. General Purpose (SSD) volumes are suitable for a broad range of workloads, including small to medium sized databases, development, and test environments, and boot volumes.</p><p>Provisioned IOPS (SSD) volumes offer storage with consistent and low-latency performance and are designed for I/O intensive applications such as large relational or NoSQL databases. Magnetic volumes provide the lowest cost per gigabyte of all EBS volume types.</p><p>Magnetic volumes are ideal for workloads where data are accessed infrequently, and applications where the lowest storage cost is important. Take note that this is a Previous Generation Volume. The latest low-cost magnetic storage types are Cold HDD (sc1) and Throughput Optimized HDD (st1) volumes.</p><p>Hence, the correct answers are:</p><p><strong><em>Provisioned IOPS volumes offer storage with consistent and low-latency performance, and are designed for I/O intensive applications such as large relational or NoSQL databases.</em></strong></p><p><strong><em> Magnetic volumes provide the lowest cost per gigabyte of all EBS volume types and are ideal for workloads where data is accessed infrequently, and applications where the lowest storage cost is important.</em></strong></p><p>The option that says: <strong><em>Spot volumes provide the lowest cost per gigabyte of all EBS volume types and are ideal for workloads where data is accessed infrequently, and applications where the lowest storage cost is important</em></strong><em> </em>is incorrect because there is no EBS type called a \"Spot volume\" however, there is an Instance purchasing option for Spot Instances.</p><p>The option that says: <strong><em>Reduced Redundancy Storage volumes offer consistent and low-latency performance, and are designed for I/O intensive applications such as large relational or NoSQL databases</em></strong><em> </em>is incorrect because there is no such thing as Reduced Redundancy Storage volumes. In Amazon S3, there is an obsolete storage type named: Reduced Redundancy Storage (RRS), but not in EBS.</p><p>The option that says: <strong><em>Single root I/O virtualization (SR-IOV) volumes are suitable for a broad range of workloads, including small to medium sized databases, development and test environments, and boot volumes</em></strong> is incorrect because SR-IOV is related with Enhanced Networking on Linux and not in EBS.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EBSVolumeTypes.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EBSVolumeTypes.html</a></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AmazonEBS.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AmazonEBS.html</a></p><p><br></p><p><strong>Check out this Amazon EBS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-ebs/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-ebs/</a></p></div>"
    },
    {
        "questionNo": 15,
        "questionText": "You are planning to reduce the amount of data that Amazon S3 transfers to your servers in order to lower your operating costs as well as to lower the latency of retrieving the data. To accomplish this, you need to use simple structured query language (SQL) statements to filter the contents of Amazon S3 objects and retrieve just the subset of data that you need.   \n\nWhich of the following services will help you accomplish this requirement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nS3 Select\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS Step Functions"
            },
            {
                "isCorrect": false,
                "text": "​\n\nRedshift Spectrum"
            },
            {
                "isCorrect": false,
                "text": "​\n\nRDS"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>With Amazon S3 Select, you can use simple structured query language (SQL) statements to filter the contents of Amazon S3 objects and retrieve just the subset of data that you need. By using Amazon S3 Select to filter this data, you can reduce the amount of data that Amazon S3 transfers, which reduces the cost and latency to retrieve this data.</p><p><br></p><p><img src=\"https://media.amazonwebservices.com/blog/2018/sel_select_us_airports_2.png\"></p><p><br></p><p>Amazon S3 Select works on objects stored in CSV, JSON, or Apache Parquet format. It also works with objects that are compressed with GZIP or BZIP2 (for CSV and JSON objects only), and server-side encrypted objects. You can specify the format of the results as either CSV or JSON, and you can determine how the records in the result are delimited.</p><p><strong>RDS</strong> is incorrect because although RDS is an SQL database where you can perform SQL operations, it is still not valid because you want to apply SQL transactions on S3 itself, and not on the database, which RDS cannot do.</p><p><strong>Redshift Spectrum</strong> is incorrect because although Amazon Redshift Spectrum provides a similar in-query functionality like S3 Select, this service is more suitable for querying your data from the Redshift external tables hosted in S3. The Redshift queries are run on your cluster resources against local disk. Redshift Spectrum queries run using per-query scale-out resources against data in S3 which can entail additional costs compared with S3 Select.</p><p><strong>AWS Step Functions</strong> is incorrect because this only lets you coordinate multiple AWS services into serverless workflows so you can build and update apps quickly.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/selecting-content-from-objects.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/selecting-content-from-objects.html</a></p><p><a href=\"https://docs.aws.amazon.com/redshift/latest/dg/c-using-spectrum.html\">https://docs.aws.amazon.com/redshift/latest/dg/c-using-spectrum.html</a></p><p><br></p><p><strong>Check out these AWS Cheat Sheets:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-athena/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-athena/</a></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-redshift/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-redshift/</a></p></div>"
    },
    {
        "questionNo": 16,
        "questionText": "You launched an EC2 instance in your newly created VPC. You have noticed that the generated instance does not have an associated DNS hostname.\n\nWhich of the following options could be a valid reason for this issue?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\nThe DNS resolution and DNS hostname of the VPC configuration should be enabled.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nAmazon Route53 is not enabled."
            },
            {
                "isCorrect": false,
                "text": "​\nThe security group of the EC2 instance needs to be modified."
            },
            {
                "isCorrect": false,
                "text": "​\nThe newly created VPC has an invalid CIDR block."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>When you launch an EC2 instance into a default VPC, AWS provides it with public and private DNS hostnames that correspond to the public IPv4 and private IPv4 addresses for the instance.</p><p>However, when you launch an instance into a non-default VPC, AWS provides the instance with a private DNS hostname only. New instances will only be provided with public DNS hostname depending on these two DNS attributes: the <strong>DNS resolution</strong> and <strong>DNS hostnames</strong>, that you have specified for your VPC, and if your instance has a public IPv4 address.</p><p>In this case, the new EC2 instance does not automatically get a DNS hostname because the <strong>DNS resolution</strong> and <strong>DNS hostnames</strong> attributes are disabled in the newly created VPC.</p><p>The option that says: <strong>The newly created VPC has an invalid CIDR block</strong> is incorrect since it's very unlikely that a VPC has an invalid CIDR block because of AWS validation schemes.</p><p>The option that says: <strong>Amazon Route 53 is not enabled</strong> is incorrect since Route 53 does not need to be enabled. Route 53 is the DNS service of AWS, but the VPC is the one that enables assigning of instance hostnames.</p><p>The option that says: <strong>The security group of the EC2 instance needs to be modified</strong> is incorrect since security groups are just firewalls for your instances. They filter traffic based on a set of security group rules.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/vpc-dns.html\">https://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/vpc-dns.html</a></p><p><a href=\"https://aws.amazon.com/vpc/\">https://aws.amazon.com/vpc/</a></p><p><br></p><p><strong>Check out this Amazon VPC Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-vpc/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-vpc/</a></p></div>"
    },
    {
        "questionNo": 17,
        "questionText": "You are a Cloud Migration Engineer in a media company which uses EC2, ELB, and S3 for its video-sharing portal for filmmakers. They are using a standard S3 storage class to store all high-quality videos that are frequently accessed only during the first three months of posting. What should you do if the company needs to automatically transfer or archive media data from an S3 bucket to Glacier?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nUse Amazon SWF"
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse Amazon SQS"
            },
            {
                "isCorrect": true,
                "text": "​\nUse Lifecycle Policies\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nUse a custom shell script that transfers data from the S3 bucket to Glacier"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can create a lifecycle policy in S3 to automatically transfer your data to Glacier.</p><p>Lifecycle configuration enables you to specify the lifecycle management of objects in a bucket. The configuration is a set of one or more rules, where each rule defines an action for Amazon S3 to apply to a group of objects.</p><p>These actions can be classified as follows:</p><p><strong>Transition actions</strong> – In which you define when objects transition to another storage class. For example, you may choose to transition objects to the STANDARD_IA (IA, for infrequent access) storage class 30 days after creation, or archive objects to the GLACIER storage class one year after creation.</p><p><strong>Expiration actions</strong> – In which you specify when the objects expire. Then Amazon S3 deletes the expired objects on your behalf.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lifecycle-mgmt.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lifecycle-mgmt.html</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p></div>"
    },
    {
        "questionNo": 18,
        "questionText": "You are managing an online platform which allows people to easily buy, sell, spend, and manage their cryptocurrency. To meet the strict IT audit requirements, each of the API calls on all of your AWS resources should be properly captured and recorded. You used CloudTrail in your VPC to help you in the compliance, operational auditing, and risk auditing of your AWS account.   \n\nIn this scenario, where does CloudTrail store all of the logs that it creates? ",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nDynamoDB"
            },
            {
                "isCorrect": false,
                "text": "​\nA RDS instance"
            },
            {
                "isCorrect": true,
                "text": "​\nAmazon S3\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nAmazon Redshift"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>CloudTrail is enabled on your AWS account when you create it. When activity occurs in your AWS account, that activity is recorded in a CloudTrail event. You can easily view events in the CloudTrail console by going to <strong>Event history</strong>.</p><p><br></p><p><img src=\"https://media.amazonwebservices.com/blog/2014/cloudtrail_flow_9.png\"></p><p><br></p><p>Event history allows you to view, search, and download the past 90 days of supported activity in your AWS account. In addition, you can create a CloudTrail trail to further archive, analyze, and respond to changes in your AWS resources. A trail is a configuration that enables delivery of events to an Amazon S3 bucket that you specify. You can also deliver and analyze events in a trail with Amazon CloudWatch Logs and Amazon CloudWatch Events. You can create a trail with the CloudTrail console, the AWS CLI, or the CloudTrail API.</p><p>The rest of the answers are incorrect. <strong>DynamoDB</strong> and <strong>an RDS instance</strong> are for database; <strong>Amazon Redshift</strong> is used for data warehouse that scales horizontally and allows you to store terabytes and petabytes of data.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/awscloudtrail/latest/userguide/how-cloudtrail-works.html\">https://docs.aws.amazon.com/awscloudtrail/latest/userguide/how-cloudtrail-works.html</a></p><p><a href=\"https://aws.amazon.com/cloudtrail/\">https://aws.amazon.com/cloudtrail/</a></p><p><br></p><p><strong>Check out this AWS CloudTrail Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-cloudtrail/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-cloudtrail/</a></p></div>"
    },
    {
        "questionNo": 19,
        "questionText": "A real-time data analytics application is using AWS Lambda to process data and store results in JSON format to an S3 bucket. To speed up the existing workflow, you have to use a service where you can run sophisticated Big Data analytics on your data without moving them into a separate analytics system.   \n\nWhich of the following group of services can you use to meet this requirement? ",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAmazon Glue, Glacier Select, Amazon Redshift "
            },
            {
                "isCorrect": true,
                "text": "​\n\nS3 Select, Amazon Athena, Amazon Redshift Spectrum \n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon X-Ray, Amazon Neptune, DynamoDB "
            },
            {
                "isCorrect": false,
                "text": "​\n\nS3 Select, Amazon Neptune, DynamoDB DAX "
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon S3 allows you to run sophisticated Big Data analytics on your data without moving the data into a separate analytics system. In AWS, there is a suite of tools that make analyzing and processing large amounts of data in the cloud faster, including ways to optimize and integrate existing workflows with Amazon S3:</p><p><strong>1. S3 Select</strong></p><p>Amazon S3 Select is designed to help analyze and process data within an object in Amazon S3 buckets, faster and cheaper. It works by providing the ability to retrieve a subset of data from an object in Amazon S3 using simple SQL expressions. Your applications no longer have to use compute resources to scan and filter the data from an object, potentially increasing query performance by up to 400%, and reducing query costs as much as 80%. You simply change your application to use SELECT instead of GET to take advantage of S3 Select.</p><p><strong>2. Amazon Athena</strong></p><p>Amazon Athena is an interactive query service that makes it easy to analyze data in Amazon S3 using standard SQL expressions. Athena is serverless, so there is no infrastructure to manage, and you pay only for the queries you run. Athena is easy to use. Simply point to your data in Amazon S3, define the schema, and start querying using standard SQL expressions. Most results are delivered within seconds. With Athena, there’s no need for complex ETL jobs to prepare your data for analysis. This makes it easy for anyone with SQL skills to quickly analyze large-scale datasets.</p><p><strong>3. Amazon Redshift Spectrum</strong></p><p>Amazon Redshift also includes Redshift Spectrum, allowing you to directly run SQL queries against exabytes of unstructured data in Amazon S3. No loading or transformation is required, and you can use open data formats, including Avro, CSV, Grok, ORC, Parquet, RCFile, RegexSerDe, SequenceFile, TextFile, and TSV. Redshift Spectrum automatically scales query compute capacity based on the data being retrieved, so queries against Amazon S3 run fast, regardless of data set size.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://aws.amazon.com/s3/features/#Query_in_Place\">https://aws.amazon.com/s3/features/#Query_in_Place</a></p><p><br></p><p><strong>Check out these AWS Cheat Sheets:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-athena/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-athena/</a></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-redshift/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-redshift/</a></p></div>"
    },
    {
        "questionNo": 20,
        "questionText": "You have a set of Linux servers running on multiple On-Demand EC2 Instances. The Audit team wants to collect and process the application log files generated from these servers for their report. \n\nWhich of the following services is the best to use in this case?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAmazon S3 Glacier for storing the application log files and Spot EC2 Instances for processing them."
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon S3 Glacier Deep Archive for storing the application log files and AWS ParallelCluster for processing the log files."
            },
            {
                "isCorrect": true,
                "text": "​\nAmazon S3 for storing the application log files and Amazon Elastic MapReduce for processing the log files.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nA single On-Demand Amazon EC2 instance for both storing and processing the log files"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon EMR is a managed cluster platform that simplifies running big data frameworks, such as Apache Hadoop and Apache Spark, on AWS to process and analyze vast amounts of data. By using these frameworks and related open-source projects such as Apache Hive and Apache Pig, you can process data for analytics purposes and business intelligence workloads. Additionally, you can use Amazon EMR to transform and move large amounts of data into and out of other AWS data stores and databases such as Amazon Simple Storage Service (Amazon S3) and Amazon DynamoDB.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/Solutions/Big%20Data/Big%20Data%20Redesign/Big-Data-Redesign_Diagram_Enterprise-Data-Warehouse.52d3e98fc79bf05e60c0f8278f067de595d5d3b2.png\"></p><p><br></p><p>Hence, the correct answer is: <strong><em>Amazon S3 for storing the application log files and Amazon Elastic MapReduce for processing the log files</em>.</strong></p><p>The option that says: <strong><em>Amazon S3 Glacier for storing the application log files and Spot EC2 Instances for processing them</em></strong> is incorrect as Amazon S3 Glacier is used for data archive only.</p><p>The option that says: <strong><em>A single On-Demand Amazon EC2 instance for both storing and processing the log files</em></strong> is incorrect as an EC2 instance is not a recommended storage service. In addition, Amazon EC2 does not have a built-in data processing engine to process large amounts of data.</p><p>The option that says: <strong><em>Amazon S3 Glacier Deep Archive for storing the application log files and AWS ParallelCluster for processing the log files</em></strong><em> </em>is incorrect because the long retrieval time of Amazon S3 Glacier Deep Archive makes this option unsuitable. Moreover, AWS ParallelCluster is just an AWS-supported open-source cluster management tool that makes it easy for you to deploy and manage High-Performance Computing (HPC) clusters on AWS. ParallelCluster uses a simple text file to model and provision all the resources needed for your HPC applications in an automated and secure manner.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"http://docs.aws.amazon.com/emr/latest/ManagementGuide/emr-what-is-emr.html\">http://docs.aws.amazon.com/emr/latest/ManagementGuide/emr-what-is-emr.html</a></p><p><a href=\"https://aws.amazon.com/hpc/parallelcluster/\">https://aws.amazon.com/hpc/parallelcluster/</a></p><p><br></p><p><strong>Check out this Amazon EMR Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-emr/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-emr/</a></p><p><br></p><p><strong>Here is an in-depth tutorial on Amazon EMR:</strong></p><p>https://youtu.be/jylp2atrZjc</p></div>"
    },
    {
        "questionNo": 21,
        "questionText": "A tech startup has recently received a Series A round of funding to continue building their mobile forex trading application. You are hired to set up their cloud architecture in AWS and to implement a highly available, fault tolerant system. For their database, they are using DynamoDB and for authentication, they have chosen to use Cognito. Since the mobile application contains confidential financial transactions, there is a requirement to add a second authentication method that doesn't rely solely on user name and password.   \n\nHow can you implement this in AWS?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nIntegrate Cognito with Amazon SNS Mobile Push to allow additional authentication via SMS."
            },
            {
                "isCorrect": false,
                "text": "​\n\nDevelop a custom application that integrates with Cognito that implements a second layer of authentication."
            },
            {
                "isCorrect": false,
                "text": "​\n\nAdd a new IAM policy to a user pool in Cognito."
            },
            {
                "isCorrect": true,
                "text": "​\n\nAdd multi-factor authentication (MFA) to a user pool in Cognito to protect the identity of your users.\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can add multi-factor authentication (MFA) to a user pool to protect the identity of your users. MFA adds a second authentication method that doesn't rely solely on user name and password. You can choose to use SMS text messages, or time-based one-time (TOTP) passwords as second factors in signing in your users. You can also use adaptive authentication with its risk-based model to predict when you might need another authentication factor. It's part of the user pool advanced security features, which also include protections against compromised credentials.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/cognito/latest/developerguide/managing-security.html\">https://docs.aws.amazon.com/cognito/latest/developerguide/managing-security.html</a></p></div>"
    },
    {
        "questionNo": 22,
        "questionText": "A popular augmented reality (AR) mobile game is heavily using a RESTful API which is hosted in AWS. The API uses Amazon API Gateway and a DynamoDB table with a preconfigured read and write capacity. Based on your systems monitoring, the DynamoDB table begins to throttle requests during high peak loads which causes the slow performance of the game. \n\nWhich of the following can you do to improve the performance of your app? ",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nIntegrate an Application Load Balancer with your DynamoDB table. "
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate an SQS queue in front of the DynamoDB table. "
            },
            {
                "isCorrect": false,
                "text": "​\n\nAdd the DynamoDB table to an Auto Scaling Group. "
            },
            {
                "isCorrect": true,
                "text": "​\n\nUse DynamoDB Auto Scaling \n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>DynamoDB auto scaling uses the AWS Application Auto Scaling service to dynamically adjust provisioned throughput capacity on your behalf, in response to actual traffic patterns. This enables a table or a global secondary index to increase its provisioned read and write capacity to handle sudden increases in traffic, without throttling. When the workload decreases, Application Auto Scaling decreases the throughput so that you don't pay for unused provisioned capacity.</p><p><strong>Using DynamoDB Auto Scaling</strong> is the best answer. DynamoDB Auto Scaling uses the AWS Application Auto Scaling service to dynamically adjust provisioned throughput capacity on your behalf.</p><p><strong>Integrating an Application Load Balancer with your DynamoDB table</strong> is incorrect because an Application Load Balancer is not suitable to be used with DynamoDB and in addition, this will not increase the throughput of your DynamoDB table.</p><p><strong>Adding the DynamoDB table to an Auto Scaling Group</strong> is incorrect because you usually put EC2 instances on an Auto Scaling Group, and not a DynamoDB table.</p><p><strong>Creating an SQS queue in front of the DynamoDB table</strong> is incorrect because this is not a design principle for high throughput DynamoDB table. Using SQS is for handling queuing and polling the request. This will not increase the throughput of DynamoDB which is required in this situation.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/AutoScaling.html\">https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/AutoScaling.html</a></p><p><br></p><p><strong>Check out this Amazon DynamoDB Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-dynamodb/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-dynamodb/</a></p></div>"
    },
    {
        "questionNo": 23,
        "questionText": "A web application requires a minimum of six Amazon Elastic Compute Cloud (EC2) instances running at all times. You are tasked to deploy the application to three availability zones in the EU Ireland region (eu-west-1a, eu-west-1b, and eu-west-1c). It is required that the system is fault-tolerant up to the loss of one Availability Zone.\n\nWhich of the following setup is the most cost-effective solution which also maintains the fault-tolerance of your system?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\n6 instances in eu-west-1a, 6 instances in eu-west-1b, and 6 instances in eu-west-1c"
            },
            {
                "isCorrect": false,
                "text": "​\n\n6 instances in eu-west-1a, 6 instances in eu-west-1b, and no instances in eu-west-1c"
            },
            {
                "isCorrect": true,
                "text": "​\n\n3 instances in eu-west-1a, 3 instances in eu-west-1b, and 3 instances in eu-west-1c\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\n2 instances in eu-west-1a, 2 instances in eu-west-1b, and 2 instances in eu-west-1c"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Basically, fault-tolerance is the ability of a system to remain in operation even in the event that some of its components fail, without any service degradation. In AWS, it can also refer to the minimum number of running EC2 instances or resources which should be running at all times in order for the system to properly operate and serve its consumers. Take note that this is quite different from the concept of High Availability, which is just concerned with having at least one running instance or resource in case of failure.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/documentdb/latest/developerguide/images/RegionsAndAZs.png\"></p><p><br></p><p>In this scenario, <strong>3 instances in eu-west-1a, 3 instances in eu-west-1b, and 3 instances in eu-west-1c</strong> is the correct answer because even if there was an outage in one of the Availability Zones, the system still satisfies the requirement of having a minimum of 6 running instances. It is also the most cost-effective solution among other options.</p><p>The option that says: <strong>6 instances in eu-west-1a, 6 instances in eu-west-1b, and 6 instances in eu-west-1c</strong> is incorrect because although this solution provides the maximum fault-tolerance for the system, it entails a significant cost to maintain a total of 18 instances across 3 AZs.</p><p>The option that says: <strong>2 instances in eu-west-1a, 2 instances in eu-west-1b, and 2 instances in eu-west-1c</strong> is incorrect because if one Availability Zone goes down, there will only be 4 running instances available. Although this is the most cost-effective solution, it does not provide fault-tolerance.</p><p>The option that says: <strong>6 instances in eu-west-1a, 6 instances in eu-west-1b, and no instances in eu-west-1c</strong> is incorrect because although it provides fault-tolerance, it is not the most cost-effective solution as compared with the options above. This solution has 12 running instances, unlike the correct answer which only has 9 instances.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-increase-availability.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-increase-availability.html</a></p><p><a href=\"https://media.amazonwebservices.com/AWS_Building_Fault_Tolerant_Applications.pdf\">https://media.amazonwebservices.com/AWS_Building_Fault_Tolerant_Applications.pdf</a></p></div>"
    },
    {
        "questionNo": 24,
        "questionText": "You are working for a large global media company with multiple office locations all around the world. You are instructed to build a system to distribute training videos to all employees. Using CloudFront, what method would be used to serve content that is stored in S3, but not publicly accessible from S3 directly?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nCreate an S3 bucket policy that lists the CloudFront distribution ID as the principal and the target bucket as the Amazon Resource Name (ARN)."
            },
            {
                "isCorrect": false,
                "text": "​\nAdd the CloudFront account security group."
            },
            {
                "isCorrect": false,
                "text": "​\nCreate an Identity and Access Management (IAM) user for CloudFront and grant access to the objects in your S3 bucket to that IAM user."
            },
            {
                "isCorrect": true,
                "text": "​\nCreate an Origin Access Identity (OAI) for CloudFront and grant access to the objects in your S3 bucket to that OAI.\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>When you create or update a distribution in CloudFront, you can add an origin access identity (OAI) and automatically update the bucket policy to give the origin access identity permission to access your bucket. Alternatively, you can choose to manually change the bucket policy or change ACLs, which control permissions on individual objects in your bucket.</p><p>You can update the Amazon S3 bucket policy using either the AWS Management Console or the Amazon S3 API:</p><p>- Grant the CloudFront origin access identity the applicable permissions on the bucket.</p><p>- Deny access to anyone that you don't want to have access using Amazon S3 URLs.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/private-content-restricting-access-to-s3.html#private-content-granting-permissions-to-oai\">https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/private-content-restricting-access-to-s3.html#private-content-granting-permissions-to-oai</a></p><p><br></p><p><strong>Check out this Amazon CloudFront Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudfront/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudfront/</a></p><p><br></p><p><strong>S3 Pre-signed URLs vs CloudFront Signed URLs vs Origin Access Identity (OAI)</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-s3-pre-signed-urls-vs-cloudfront-signed-urls-vs-origin-access-identity-oai/\">https://tutorialsdojo.com/aws-cheat-sheet-s3-pre-signed-urls-vs-cloudfront-signed-urls-vs-origin-access-identity-oai/</a></p><p><br></p><p><strong>Comparison of AWS Services Cheat Sheets:</strong></p><p><a href=\"https://tutorialsdojo.com/comparison-of-aws-services-for-udemy-students/\">https://tutorialsdojo.com/comparison-of-aws-services-for-udemy-students/</a></p></div>"
    },
    {
        "questionNo": 25,
        "questionText": "A technology company is building a new cryptocurrency trading platform that allows buying and selling of Bitcoin, Ethereum, XRP, Ripple and many others. You were hired as a Cloud Engineer to build the required infrastructure needed for this new trading platform. On your first week at work, you started to create CloudFormation YAML scripts that defines all of the needed AWS resources for the application. Your manager was shocked that you haven't created the EC2 instances, S3 buckets and other AWS resources straight away. He does not understand the text-based scripts that you have done and was disappointed that you are just slacking off at your job. \n\nIn this scenario, what are the benefits of using the Amazon CloudFormation service that you should tell your manager to clarify his concerns? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nA storage location for the code of your application"
            },
            {
                "isCorrect": true,
                "text": "​\n\nEnables modeling, provisioning, and version-controlling of your entire AWS infrastructure\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nProvides highly durable and scalable data storage"
            },
            {
                "isCorrect": true,
                "text": "​\nAllows you to model your entire infrastructure in a text file\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nUsing CloudFormation itself is free, including the AWS resources that have been created."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>AWS CloudFormation</strong> provides a common language for you to describe and provision all the infrastructure resources in your cloud environment. CloudFormation allows you to use a simple text file to model and provision, in an automated and secure manner, all the resources needed for your applications across all regions and accounts. This file serves as the single source of truth for your cloud environment. AWS CloudFormation is available at no additional charge, and you pay only for the AWS resources needed to run your applications.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/images/create-stack-diagram.png\"></p><p><br></p><p>Hence, the correct answers are:</p><p><strong><em>Enables modeling, provisioning, and version-controlling of your entire AWS infrastructure</em></strong></p><p><strong><em>Allows you to model your entire infrastructure in a text file</em></strong></p><p><br></p><p>The option that says: <strong><em>Provides highly durable and scalable data storage</em></strong><em> </em>is incorrect because CloudFormation is not a data storage service.</p><p>The option that says: <strong><em>A storage location for the code of your application</em></strong> is incorrect because CloudFormation is not used to store your application code. You have to use CodeCommit as a code repository and not CloudFormation.</p><p>The option that says: <strong><em>Using CloudFormation itself is free, including the AWS resources that have been created</em></strong> is incorrect because although the use of CloudFormation service is free, you have to pay the AWS resources that you created.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/cloudformation/\">https://aws.amazon.com/cloudformation/</a></p><p><a href=\"https://aws.amazon.com/cloudformation/faqs/\">https://aws.amazon.com/cloudformation/faqs/</a></p><p><br></p><p><strong>Check out this AWS CloudFormation Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-cloudformation/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-cloudformation/</a></p></div>"
    },
    {
        "questionNo": 26,
        "questionText": "You are working for a media company and you need to configure an Amazon S3 bucket to serve static assets for your public-facing web application. Which methods ensure that all of the objects uploaded to the S3 bucket can be read publicly all over the Internet? (Select TWO.)",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nGrant public read access to the object when uploading it using the S3 Console.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nConfigure the ACL of the S3 bucket to set all objects to be publicly readable and writeable."
            },
            {
                "isCorrect": true,
                "text": "​\nConfigure the S3 bucket policy to set all objects to public read.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nCreate an IAM role to set the objects inside the S3 bucket to public read."
            },
            {
                "isCorrect": false,
                "text": "​\nDo nothing. Amazon S3 objects are already public by default."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>By default, all Amazon S3 resources such as buckets, objects, and related subresources are private which means that only the AWS account holder (resource owner) that created it has access to the resource. The resource owner can optionally grant access permissions to others by writing an access policy. In S3, you also set the permissions of the object during upload to make it public.</p><p>Amazon S3 offers access policy options broadly categorized as resource-based policies and user policies. Access policies you attach to your resources (buckets and objects) are referred to as resource-based policies.</p><p>For example, bucket policies and access control lists (ACLs) are resource-based policies. You can also attach access policies to users in your account. These are called user policies. You may choose to use resource-based policies, user policies, or some combination of these to manage permissions to your Amazon S3 resources.</p><p>You can also manage the public permissions of your objects during upload. Under <em>Manage public permissions</em> you can grant read access to your objects to the general public (everyone in the world), for all of the files that you're uploading. Granting public read access is applicable to a small subset of use cases such as when buckets are used for websites.</p><p><img src=\"https://i.udemycdn.com/redactor/raw/2020-05-22_03-44-35-8faafd3a03fc514d237f5eb8ded2faee.png\"></p><p>Hence, the correct answers are:</p><p><strong>Grant public read access to the object when uploading it using the S3 Console.</strong></p><p><strong>Configure the S3 bucket policy to set all objects to public read.</strong></p><p><strong>Configuring the ACL of the S3 bucket to set all objects to be publicly readable and writeable</strong> is incorrect as ACLs are primarily used to grant basic read/write permissions to AWS accounts and are not suitable for providing public access over the Internet.</p><p><strong>Creating an IAM role to set the objects inside the S3 bucket to public read</strong> is incorrect. You can create an IAM role and attach it to an EC2 instance in order to retrieve objects from the S3 bucket or add new ones. An IAM Role, in itself, cannot directly make the S3 objects public or change the permissions of each individual object.</p><p>The option that says: <strong>Do nothing. Amazon S3 objects are already public by default</strong> is incorrect because by default, all the S3 resources are private, so only the AWS account that created the resources can access them.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"http://docs.aws.amazon.com/AmazonS3/latest/dev/s3-access-control.html\">http://docs.aws.amazon.com/AmazonS3/latest/dev/s3-access-control.html</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/BucketRestrictions.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/BucketRestrictions.html</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p><p><br></p><p><strong>Additional learning material:</strong> How do I configure an S3 bucket policy to Deny all actions unless they meet certain conditions?</p><p><a href=\"https://youtu.be/8ew8MSXBiA4\">https://youtu.be/8ew8MSXBiA4</a></p></div>"
    },
    {
        "questionNo": 27,
        "questionText": "You are a Solutions Architect working for a large multinational investment bank. They have a web application that requires a minimum of 4 EC2 instances to run to ensure that it can cater to its users across the globe. You are instructed to ensure fault tolerance of this system.\n\nWhich of the following is the best option?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\nDeploy an Auto Scaling group with 2 instances in each of 3 Availability Zones behind an Application Load Balancer.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nDeploy an Auto Scaling group with 1 instance in each of 4 Availability Zones behind an Application Load Balancer."
            },
            {
                "isCorrect": false,
                "text": "​\nDeploy an Auto Scaling group with 4 instances in one Availability Zone behind an Application Load Balancer."
            },
            {
                "isCorrect": false,
                "text": "​\nDeploy an Auto Scaling group with 2 instances in each of 2 Availability Zones behind an Application Load Balancer."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Fault Tolerance is the ability of a system to remain in operation even if some of the components used to build the system fail. In AWS, this means that in the event of server fault or system failures, the number of running EC2 instances should not fall below the minimum number of instances required by the system for it to work properly. So if the application requires a minimum of 4 instances, there should be at least 4 instances running in case there is an outage in one of the Availability Zones or if there are server issues.</p><p>One of the differences between Fault Tolerance and High Availability is that, the former refers to the minimum number of running instances. For example, you have a system that requires a minimum of 4 running instances and currently has 6 running instances deployed in two Availability Zones. There was a component failure in one of the Availability Zones which knocks out 3 instances. In this case, the system can still be regarded as Highly Available since there are still instances running that can accomodate the requests. However, it is not Fault Tolerant since the required minimum of four instances have not been met.</p><p>As such, <strong><em>deploying an Auto Scaling group with 2 instances in each of 3 Availability Zones behind an Application Load Balancer</em></strong><em> </em>is the correct answer because even if there was an outage in one of the Availability Zones, the system still satisfies the requirement of a minimum of 4 running instances.</p><p><strong><em>Deploying an Auto Scaling group with 2 instances in each of 2 Availability Zones behind an Application Load Balancer</em></strong> is incorrect because if one Availability Zone went out, there will only be 2 running instances available out of the required 4 minimum instances. Although the Auto Scaling group can spin up another 2 instances, the fault tolerance of the web application has already been compromised.</p><p><strong><em>Deploying an Auto Scaling group with 4 instances in one Availability Zone behind an Application Load Balancer</em></strong> is incorrect because if the Availability Zone went out, there will be no running instance available to accommodate the request.</p><p><strong><em>Deploying an Auto Scaling group with 1 instance in each of 4 Availability Zones behind an Application Load Balancer</em></strong><em> </em>is incorrect because if one Availability Zone went out, there will only be 3 instances available to accommodate the request.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://media.amazonwebservices.com/AWS_Building_Fault_Tolerant_Applications.pdf\">https://media.amazonwebservices.com/AWS_Building_Fault_Tolerant_Applications.pdf</a></p><p><a href=\"https://d1.awsstatic.com/whitepapers/aws-building-fault-tolerant-applications.pdf\">https://d1.awsstatic.com/whitepapers/aws-building-fault-tolerant-applications.pdf</a></p></div>"
    },
    {
        "questionNo": 28,
        "questionText": "You are a Big Data Engineer who is assigned to handle the online enrollment system database of a prestigious university, which is hosted in RDS. You are required to monitor the database metrics in Amazon CloudWatch to ensure the availability of the enrollment system.\n\nWhat are the enhanced monitoring metrics that Amazon CloudWatch gathers from Amazon RDS DB instances which provide a more accurate information? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nCPU Utilization"
            },
            {
                "isCorrect": false,
                "text": "​\n\nDatabase Connections"
            },
            {
                "isCorrect": true,
                "text": "​\n\nOS processes\n\n(Correct)"
            },
            {
                "isCorrect": true,
                "text": "​\nRDS child processes.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nFreeable Memory"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>Amazon RDS</strong> provides metrics in real time for the operating system (OS) that your DB instance runs on. You can view the metrics for your DB instance using the console, or consume the Enhanced Monitoring JSON output from CloudWatch Logs in a monitoring system of your choice.</p><p><strong>CloudWatch</strong> gathers metrics about CPU utilization from the hypervisor for a DB instance, and Enhanced Monitoring gathers its metrics from an agent on the instance. As a result, you might find differences between the measurements, because the hypervisor layer performs a small amount of work. The differences can be greater if your DB instances use smaller instance classes, because then there are likely more virtual machines (VMs) that are managed by the hypervisor layer on a single physical instance. Enhanced Monitoring metrics are useful when you want to see how different processes or threads on a DB instance use the CPU.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/images/metrics1.png\"></p><p><br></p><p>In RDS, the Enhanced Monitoring metrics shown in the Process List view are organized as follows:</p><p><strong>RDS child processes</strong> – Shows a summary of the RDS processes that support the DB instance, for example <code>aurora</code> for Amazon Aurora DB clusters and <code>mysqld</code> for MySQL DB instances. Process threads appear nested beneath the parent process. Process threads show CPU utilization only as other metrics are the same for all threads for the process. The console displays a maximum of 100 processes and threads. The results are a combination of the top CPU consuming and memory consuming processes and threads. If there are more than 50 processes and more than 50 threads, the console displays the top 50 consumers in each category. This display helps you identify which processes are having the greatest impact on performance.</p><p><strong><em>RDS processes</em></strong> – Shows a summary of the resources used by the RDS management agent, diagnostics monitoring processes, and other AWS processes that are required to support RDS DB instances.</p><p><strong><em>OS processes</em></strong><em> </em>– Shows a summary of the kernel and system processes, which generally have minimal impact on performance.</p><p><strong><em>CPU Utilization, Database Connections, </em></strong>and<strong><em> Freeable Memory</em></strong><em> </em>are incorrect because these are just the regular items provided by Amazon RDS Metrics in CloudWatch. Remember that the scenario is asking for the Enhanced Monitoring metrics.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/rds-metricscollected.html\">https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/rds-metricscollected.html</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_Monitoring.OS.html#USER_Monitoring.OS.CloudWatchLogs\">https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_Monitoring.OS.html#USER_Monitoring.OS.CloudWatchLogs</a></p><p><br></p><p><strong>Check out this Amazon CloudWatch Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/</a></p><p><br></p><p><strong>Check out this Amazon RDS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-relational-database-service-amazon-rds/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-relational-database-service-amazon-rds/</a></p></div>"
    },
    {
        "questionNo": 29,
        "questionText": "A Solutions Architect is designing a setup for a database that will run on Amazon RDS for MySQL. He needs to ensure that the database can automatically failover to an RDS instance to continue operating in the event of failure. The architecture should also be as highly available as possible.\n\nWhich among the following actions should the Solutions Architect do?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nCreate five read replicas across different availability zones. In the event of an Availability Zone outage, promote any replica to become the primary instance."
            },
            {
                "isCorrect": true,
                "text": "​\n\nCreate a standby replica in another availability zone by enabling Multi-AZ deployment.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate five cross-region read replicas in each region. In the event of an Availability Zone outage, promote any replica to become the primary instance."
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a read replica in the same region where the DB instance resides. In addition, create a read replica in a different region to survive a region’s failure. In the event of an Availability Zone outage, promote any replica to become the primary instance."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can run an Amazon RDS DB instance in several AZs with Multi-AZ deployment. Amazon automatically provisions and maintains a secondary standby DB instance in a different AZ. Your primary DB instance is synchronously replicated across AZs to the secondary instance to provide data redundancy, failover support, eliminate I/O freezes, and minimize latency spikes during systems backup.</p><p><img src=\"https://d1.awsstatic.com/asset-repository/multi-az-deployments.bda9d7bf45a74103d0331a985baf2c5fb838a0fa.png\"></p><p>As described in the scenario, the architecture must meet two requirements:</p><p>The database should automatically failover to an RDS instance in case of failures.</p><p>The architecture should be as highly available as possible.</p><p>Hence, the correct answer is: <strong>Create a standby replica in another availability zone by enabling Multi-AZ deployment </strong>because it meets both of the requirements.</p><p>The option that says: <strong>Create a read replica in the same region where the DB instance resides. In addition, create a read replica in a different region to survive a region's failure. In the event of an Availability Zone outage, promote any replica to become the primary instance </strong>is incorrect. Although this architecture provides higher availability since it can survive a region failure, it still does not meet the first requirement since the process is not automated. The architecture should also support automatic failover to an RDS instance in case of failures.</p><p>Both the following options are incorrect:</p><p><strong>- Create five read replicas across different availability zones. In the event of an Availability Zone outage, promote any replica to become the primary instance</strong></p><p><strong>- Create five cross-region read replicas in each region. In the event of an Availability Zone outage, promote any replica to become the primary instance</strong></p><p>Although it is possible to achieve high availability with these architectures by promoting a read replica into the primary instance in an event of failure, it does not support automatic failover to an RDS instance which is also a requirement in the problem.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/rds/features/multi-az/\">https://aws.amazon.com/rds/features/multi-az/</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Concepts.MultiAZ.html\">https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Concepts.MultiAZ.html</a></p><p><br></p><p><strong>Check out this Amazon RDS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-relational-database-service-amazon-rds/\">https://tutorialsdojo.com/amazon-relational-database-service-amazon-rds/</a></p></div>"
    },
    {
        "questionNo": 30,
        "questionText": "You are working as a Solutions Architect for a leading data analytics company in which you are tasked to process real-time streaming data of your users across the globe. This will enable you to track and analyze globally-distributed user activity on your website and mobile applications, including click stream analysis. Your cloud architecture should process the data in close geographical proximity to your users and to respond to user requests at low latencies.\n\nWhich of the following options is the most ideal solution that you should implement?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nIntegrate CloudFront with Lambda@Edge in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Amazon Athena and durably store the results to an Amazon S3 bucket."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse a CloudFront web distribution and Route 53 with a latency-based routing policy, in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Kinesis and durably store the results to an Amazon S3 bucket."
            },
            {
                "isCorrect": true,
                "text": "​\n\nIntegrate CloudFront with Lambda@Edge in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Kinesis and durably store the results to an Amazon S3 bucket.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse a CloudFront web distribution and Route 53 with a Geoproximity routing policy in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Kinesis and durably store the results to an Amazon S3 bucket."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Lambda@Edge is a feature of Amazon CloudFront that lets you run code closer to users of your application, which improves performance and reduces latency. With Lambda@Edge, you don't have to provision or manage infrastructure in multiple locations around the world. You pay only for the compute time you consume - there is no charge when your code is not running.</p><p>With Lambda@Edge, you can enrich your web applications by making them globally distributed and improving their performance — all with zero server administration. Lambda@Edge runs your code in response to events generated by the Amazon CloudFront content delivery network (CDN). Just upload your code to AWS Lambda, which takes care of everything required to run and scale your code with high availability at an AWS location closest to your end user.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/products/cloudfront/AWS-Lambda-at-Edge_User-Tracking-Analytics-diagram%20Oct%202018.5cc920f99c9450467b7290c20a8a4eb7c444e915.png\"></p><p><br></p><p>By using Lambda@Edge and Kinesis together, you can process real-time streaming data so that you can track and analyze globally-distributed user activity on your website and mobile applications, including clickstream analysis. Hence, the correct answer in this scenario is the option that says: <strong>Integrate CloudFront with Lambda@Edge in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Kinesis and durably store the results to an Amazon S3 bucket.</strong></p><p>The options that say: <strong>Use a CloudFront web distribution and Route 53 with a latency-based routing policy, in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Kinesis and durably store the results to an Amazon S3 bucket</strong> and <strong>Use a CloudFront web distribution and Route 53 with a Geoproximity routing policy in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Kinesis and durably store the results to an Amazon S3 bucket</strong> are both incorrect because you can only route traffic using Route 53 since it does not have any computing capability. This solution would not be able to process and return the data in close geographical proximity to your users since it is not using Lambda@Edge.</p><p>The option that says: <strong>Integrate CloudFront with Lambda@Edge in order to process the data in close geographical proximity to users and respond to user requests at low latencies. Process real-time streaming data using Amazon Athena and durably store the results to an Amazon S3 bucket</strong> is incorrect because although using Lambda@Edge is correct, Amazon Athena is just an interactive query service that enables you to easily analyze data in Amazon S3 using standard SQL. Kinesis should be used to process the streaming data in real-time.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/lambda/edge/\">https://aws.amazon.com/lambda/edge/</a></p><p><a href=\"https://aws.amazon.com/blogs/networking-and-content-delivery/global-data-ingestion-with-amazon-cloudfront-and-lambdaedge/\">https://aws.amazon.com/blogs/networking-and-content-delivery/global-data-ingestion-with-amazon-cloudfront-and-lambdaedge/</a></p></div>"
    },
    {
        "questionNo": 31,
        "questionText": "You have an Auto Scaling group which is configured to launch new t2.micro EC2 instances when there is a significant load increase in the application. To cope with the demand, you now need to replace those instances with a larger t2.2xlarge instance type. How would you implement this change?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\nCreate a new launch configuration with the new instance type and update the Auto Scaling Group.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nJust change the instance type to t2.2xlarge in the current launch configuration"
            },
            {
                "isCorrect": false,
                "text": "​\nChange the instance type of each EC2 instance manually."
            },
            {
                "isCorrect": false,
                "text": "​\nCreate another Auto Scaling Group and attach the new instance type."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can only specify one launch configuration for an Auto Scaling group at a time, and you can't modify a launch configuration after you've created it. Therefore, if you want to change the launch configuration for an Auto Scaling group, you must create a launch configuration and then update your Auto Scaling group with the new launch configuration.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2020-02-16_08-38-47-aa6b38010545d6907cd3f2c5e02249ac.png\"></p><p><br></p><p>Hence, the correct answer is: <strong>Create a new launch configuration with the new instance type and update the Auto Scaling Group.</strong></p><p>The option that says: <strong>Just change the instance type to t2.2xlarge in the current launch configuration</strong><em> </em>is incorrect because you can't change your launch configuration once it is created. You have to create a new one instead.<br><br>The option that says: <strong>Create another Auto Scaling Group and attach the new instance type </strong>is incorrect because you can't directly attach or declare the new instance type to your Auto Scaling group. You have to create a new launch configuration first, with a new instance type, then attach it to your existing Auto Scaling group.<br><br>The option that says: <strong>Change the instance type of each EC2 instance manually</strong> is incorrect because you can't directly change the instance type of your EC2 instance. This should be done by creating a brand new launch configuration then attaching it to your existing Auto Scaling group.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/autoscaling/ec2/userguide/LaunchConfiguration.html\">https://docs.aws.amazon.com/autoscaling/ec2/userguide/LaunchConfiguration.html</a></p><p><a href=\"https://docs.aws.amazon.com/autoscaling/ec2/userguide/create-asg.html\">https://docs.aws.amazon.com/autoscaling/ec2/userguide/create-asg.html</a></p><p><br></p><p><strong>Check out this AWS Auto Scaling Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-auto-scaling/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-auto-scaling/</a></p></div>"
    },
    {
        "questionNo": 32,
        "questionText": "You are responsible for running a global news website hosted in a fleet of EC2 Instances. Lately, the load on the website has increased which resulted to slower response time for the site visitors. This issue impacts the revenue of the company as some readers tend to leave the site if it does not load after 10 seconds.   \n\nWhich of the below services in AWS can be used to solve this problem? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nDeploy the website to all regions in different VPCs for faster processing."
            },
            {
                "isCorrect": false,
                "text": "​\nFor better read throughput, use AWS Storage Gateway to distribute the content across multiple regions."
            },
            {
                "isCorrect": true,
                "text": "​\nUse Amazon ElastiCache for the website's in-memory data store or cache.\n(Correct)"
            },
            {
                "isCorrect": true,
                "text": "​\n\nUse Amazon CloudFront with website as the custom origin.\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>The global news website has a problem with latency considering that there are a lot of readers of the site from all parts of the globe. In this scenario, you can use a content delivery network (CDN) which is a geographically distributed group of servers which work together to provide fast delivery of Internet content. And since this is a news website, most of its data are read-only, which can be cached to improve the read throughput and avoid the repetitive requests from the server.</p><p>In AWS, Amazon CloudFront is the global content delivery network (CDN) service that you can use and for web caching, Amazon ElastiCache is the suitable service. Hence, the correct answers here are <strong>using Amazon CloudFront with website as the custom origin</strong> and <strong>using Amazon ElastiCache for the website's in-memory data store or cache</strong>.</p><p>The option that says: <strong>For better read throughput, use AWS Storage Gateway to distribute the content across multiple regions</strong> is incorrect as AWS Storage Gateway is used for storage.</p><p><strong>Deploying the website to all regions in different VPCs for faster processing</strong> is incorrect as this would be costly and totally unnecessary considering that you can use Amazon CloudFront and ElastiCache to improve the performance of the website.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/elasticache/\">https://aws.amazon.com/elasticache/</a></p><p><a href=\"http://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/Introduction.html\">http://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/Introduction.html</a></p><p><br></p><p><strong>Check out this Amazon CloudFront Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudfront/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudfront/</a></p></div>"
    },
    {
        "questionNo": 33,
        "questionText": "A new company policy requires IAM users to change their passwords’ minimum length to 12 characters. After a random inspection, you found out that there are still employees who do not follow the policy.\n\nHow can you automatically check and evaluate whether the current password policy for an account complies with the company password policy?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nConfigure AWS Config to trigger an evaluation that will check the compliance for a user’s password periodically.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a CloudTrail trail. Filter the result by setting the attribute to “Event Name” and lookup value to “ChangePassword”. This easily gives you the list of users who have made changes to their passwords."
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a rule in the Amazon CloudWatch event. Build an event pattern to match events on IAM. Set the event name to “ChangePassword” in the event pattern. Configure SNS to send notifications to you whenever a user has made changes to his password."
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a Scheduled Lambda Function that will run a custom script to check compliance against changes made to the passwords periodically."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>AWS Config</strong> is a service that enables you to assess, audit, and evaluate the configurations of your AWS resources. Config continuously monitors and records your AWS resource configurations and allows you to automate the evaluation of recorded configurations against desired configurations.</p><p><img src=\"https://docs.aws.amazon.com/config/latest/developerguide/images/how-AWSconfig-works.png\"></p><p>In the scenario given, we can utilize AWS Config to check for compliance on the password policy by configuring the Config rule to check the IAM_PASSWORD_POLICY on an account. Additionally, because Config integrates with AWS Organizations, we can improve the set up to aggregate compliance information across accounts to a central dashboard.</p><p>Hence, the correct answer is: <strong>Configure AWS Config to trigger an evaluation that will check the compliance for a user’s password periodically</strong>.</p><p><strong>Create a CloudTrail trail. Filter the result by setting the attribute to “Event Name” and lookup value to “ChangePassword”. This easily gives you the list of users who have made changes to their passwords </strong>is incorrect because this setup will just give you the name of the users who have made changes to their respective passwords. It will not give you the ability to check whether their passwords have met the required minimum length.</p><p><strong>Create a Scheduled Lambda function that will run a custom script to check compliance against changes made to the passwords periodically </strong>is a valid solution but still incorrect. AWS Config is already integrated with AWS Lambda. You don't have to create and manage your own Lambda function. You just have to define a Config rule where you will check compliance, and Lambda will process the evaluation. Moreover, you can't directly create a scheduled function by using Lambda itself. You have to create a rule in AWS CloudWatch Events to run the Lambda functions on the schedule that you define.</p><p><strong>Create a rule in the Amazon CloudWatch event. Build an event pattern to match events on IAM. Set the event name to “ChangePassword” in the event pattern. Configure SNS to send notifications to you whenever a user has made changes to his password</strong> is incorrect because this setup will just alert you whenever a user changes his password. Sure, you’ll have information about who made changes, but that is not enough to check whether it complies with the required minimum password length. This can be easily done in AWS Config.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/config/latest/developerguide/evaluate-config-rules.html\">https://docs.aws.amazon.com/config/latest/developerguide/evaluate-config-rules.html</a></p><p><a href=\"https://aws.amazon.com/config/\">https://aws.amazon.com/config/</a></p><p><br></p><p><strong>Check out this AWS Config Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-config/?src=udemy\">https://tutorialsdojo.com/aws-config/</a></p></div>"
    },
    {
        "questionNo": 34,
        "questionText": "An automotive company is working on an autonomous vehicle development and deployment project using AWS. The solution requires High Performance Computing (HPC) in order to collect, store and manage massive amounts of data as well as to support deep learning frameworks. The Linux EC2 instances that will be used should have a lower latency and higher throughput than the TCP transport traditionally used in cloud-based HPC systems. It should also enhance the performance of inter-instance communication and must include an OS-bypass functionality to allow the HPC to communicate directly with the network interface hardware to provide low-latency, reliable transport functionality.\n\nWhich of the following is the MOST suitable solution that you should implement to achieve the above requirements?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAttach an Elastic Network Adapter (ENA) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)."
            },
            {
                "isCorrect": false,
                "text": "​\n\nAttach a Private Virtual Interface (VIF) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)."
            },
            {
                "isCorrect": false,
                "text": "​\n\nAttach an Elastic Network Interface (ENI) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)."
            },
            {
                "isCorrect": true,
                "text": "​\n\nAttach an Elastic Fabric Adapter (EFA) on each Amazon EC2 instance to accelerate High Performance Computing (HPC).\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>An Elastic Fabric Adapter (EFA)</strong> is a network device that you can attach to your Amazon EC2 instance to accelerate High Performance Computing (HPC) and machine learning applications. EFA enables you to achieve the application performance of an on-premises HPC cluster, with the scalability, flexibility, and elasticity provided by the AWS Cloud.</p><p>EFA provides lower and more consistent latency and higher throughput than the TCP transport traditionally used in cloud-based HPC systems. It enhances the performance of inter-instance communication that is critical for scaling HPC and machine learning applications. It is optimized to work on the existing AWS network infrastructure and it can scale depending on application requirements.</p><p>EFA integrates with Libfabric 1.9.0 and it supports Open MPI 4.0.2 and Intel MPI 2019 Update 6 for HPC applications, and Nvidia Collective Communications Library (NCCL) for machine learning applications.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/images/efa_stack.png\"></p><p><br></p><p>The OS-bypass capabilities of EFAs are not supported on Windows instances. If you attach an EFA to a Windows instance, the instance functions as an Elastic Network Adapter, without the added EFA capabilities.</p><p>Elastic Network Adapters (ENAs) provide traditional IP networking features that are required to support VPC networking. EFAs provide all of the same traditional IP networking features as ENAs, and they also support OS-bypass capabilities. OS-bypass enables HPC and machine learning applications to bypass the operating system kernel and to communicate directly with the EFA device.</p><p>Hence, the correct answer is to <strong><em>attach an Elastic Fabric Adapter (EFA) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)</em></strong><em>.</em></p><p><strong><em>Attaching an Elastic Network Adapter (ENA) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)</em></strong> is incorrect because Elastic Network Adapter (ENA) doesn't have OS-bypass capabilities, unlike EFA.</p><p><strong><em>Attaching an Elastic Network Interface (ENI) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)</em></strong> is incorrect because an Elastic Network Interface (ENI) is simply a logical networking component in a VPC that represents a virtual network card. It doesn't have OS-bypass capabilities that allow the HPC to communicate directly with the network interface hardware to provide low-latency, reliable transport functionality.</p><p><strong><em>Attaching a Private Virtual Interface (VIF) on each Amazon EC2 instance to accelerate High Performance Computing (HPC)</em></strong> is incorrect because Private Virtual Interface just allows you to connect to your VPC resources on your private IP address or endpoint.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/efa.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/efa.html</a></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/enhanced-networking-ena\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/enhanced-networking-ena</a></p><p><br></p><p><strong>Check out this Elastic Fabric Adapter (EFA) Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-elastic-fabric-adapter-efa/\">https://tutorialsdojo.com/aws-cheat-sheet-elastic-fabric-adapter-efa/</a></p></div>"
    },
    {
        "questionNo": 35,
        "questionText": "A Solutions Architect is designing the cloud architecture for the enterprise application suite of the company. Both the web and application tiers need to access the Internet to fetch data from public APIs. However, these servers should be inaccessible from the Internet.\n\nWhich of the following steps should the Architect implement to meet the above requirements?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nDeploy a NAT gateway in the public subnet and add a route to it from the private subnet where the web and application tiers are hosted.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nDeploy the web and application tier instances to a private subnet and then allocate an Elastic IP address to each EC2 instance."
            },
            {
                "isCorrect": false,
                "text": "​\n\nDeploy a NAT gateway in the private subnet and add a route to it from the public subnet where the web and application tiers are hosted."
            },
            {
                "isCorrect": false,
                "text": "​\n\nDeploy the web and application tier instances to a public subnet and then allocate an Elastic IP address to each EC2 instance."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can use a network address translation (NAT) gateway to enable instances in a private subnet to connect to the internet or other AWS services, but prevent the internet from initiating a connection with those instances. You are charged for creating and using a NAT gateway in your account.</p><p>NAT gateway hourly usage and data processing rates apply. Amazon EC2 charges for data transfer also apply. NAT gateways are not supported for IPv6 traffic—use an egress-only internet gateway instead.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/vpc/latest/userguide/images/nat-gateway-diagram.png\"></p><p><br></p><p>To create a NAT gateway, you must specify the public subnet in which the NAT gateway should reside. You must also specify an Elastic IP address to associate with the NAT gateway when you create it. The Elastic IP address cannot be changed once you associate it with the NAT Gateway.</p><p>After you've created a NAT gateway, you must update the route table associated with one or more of your private subnets to point Internet-bound traffic to the NAT gateway. This enables instances in your private subnets to communicate with the internet. Each NAT gateway is created in a specific Availability Zone and implemented with redundancy in that zone. You have a limit on the number of NAT gateways you can create in an Availability Zone.</p><p>Hence, the correct answer is to <strong>deploy a NAT gateway in the public subnet and add a route to it from the private subnet where the web and application tiers are hosted.</strong></p><p><strong>Deploying the web and application tier instances to a private subnet and then allocating an Elastic IP address to each EC2 instance</strong> is incorrect because an Elastic IP address is just a static, public IPv4 address. In this scenario, you have to use a NAT Gateway instead.</p><p><strong>Deploying a NAT gateway in the private subnet and adding a route to it from the public subnet where the web and application tiers are hosted</strong> is incorrect because you have to deploy a NAT gateway in the public subnet instead and not on a private one.</p><p><strong>Deploying the web and application tier instances to a public subnet and then allocating an Elastic IP address to each EC2 instance</strong> is incorrect because having an EIP address is irrelevant as it is only a static, public IPv4 address. Moreover, you should deploy the web and application tier in the private subnet instead of a public subnet to make it inaccessible from the Internet and then just add a NAT Gateway to allow outbound Internet connection.</p><p><br><strong>Reference</strong>:</p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/vpc-nat-gateway.html\">https://docs.aws.amazon.com/vpc/latest/userguide/vpc-nat-gateway.html</a></p><p><br></p><p><strong>Check out this Amazon VPC Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-vpc/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-vpc/</a></p><p><br></p><p><strong>Tutorials Dojo's AWS Certified Solutions Architect Associate Exam Study Guide:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-certified-solutions-architect-associate/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-certified-solutions-architect-associate/</a></p></div>"
    },
    {
        "questionNo": 36,
        "questionText": "An online trading platform with thousands of clients across the globe is hosted in AWS. To reduce latency, you have to direct user traffic to the nearest application endpoint to the client. The traffic should be routed to the closest edge location via an Anycast static IP address. AWS Shield should also be integrated into the solution for DDoS protection.\n\nWhich of the following is the MOST suitable service that the Solutions Architect should use to satisfy the above requirements?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAWS PrivateLink"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon CloudFront"
            },
            {
                "isCorrect": true,
                "text": "​\n\nAWS Global Accelerator\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS WAF"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>AWS Global Accelerator</strong> is a service that improves the availability and performance of your applications with local or global users. It provides static IP addresses that act as a fixed entry point to your application endpoints in a single or multiple AWS Regions, such as your Application Load Balancers, Network Load Balancers or Amazon EC2 instances.</p><p>AWS Global Accelerator uses the AWS global network to optimize the path from your users to your applications, improving the performance of your TCP and UDP traffic. AWS Global Accelerator continually monitors the health of your application endpoints and will detect an unhealthy endpoint and redirect traffic to healthy endpoints in less than 1 minute.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/r2018/b/ubiquity/global-accelerator-how-it-works.feb297eb78d8cc55205874a1691e0ea2bc8bdbf1.png\"></p><p><br></p><p>Many applications, such as gaming, media, mobile applications, and financial applications, need very low latency for a great user experience. To improve the user experience, AWS Global Accelerator directs user traffic to the nearest application endpoint to the client, thus reducing internet latency and jitter. It routes the traffic to the closest edge location via Anycast, then by routing it to the closest regional endpoint over the AWS global network. AWS Global Accelerator quickly reacts to changes in network performance to improve your users’ application performance.</p><p>AWS Global Accelerator and Amazon CloudFront are separate services that use the AWS global network and its edge locations around the world. CloudFront improves performance for both cacheable content (such as images and videos) and dynamic content (such as API acceleration and dynamic site delivery). Global Accelerator improves performance for a wide range of applications over TCP or UDP by proxying packets at the edge to applications running in one or more AWS Regions. Global Accelerator is a good fit for non-HTTP use cases, such as gaming (UDP), IoT (MQTT), or Voice over IP, as well as for HTTP use cases that specifically require static IP addresses or deterministic, fast regional failover. Both services integrate with AWS Shield for DDoS protection.</p><p>Hence, the correct answer is <strong><em>AWS Global Accelerator</em></strong>.</p><p><strong><em>Amazon CloudFront</em></strong> is incorrect because although this service uses edge locations, it doesn't have the capability to route the traffic to the closest edge location via an Anycast static IP address.</p><p><strong><em>AWS WAF</em></strong> is incorrect because the this service is just a web application firewall that helps protect your web applications or APIs against common web exploits that may affect availability, compromise security, or consume excessive resources</p><p><strong><em>AWS PrivateLink</em></strong> is incorrect because this service simply provides private connectivity between VPCs, AWS services, and on-premises applications, securely on the Amazon network. It doesn't route traffic to the closest edge location via an Anycast static IP address.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/global-accelerator/\">https://aws.amazon.com/global-accelerator/</a></p><p><a href=\"https://aws.amazon.com/global-accelerator/faqs/\">https://aws.amazon.com/global-accelerator/faqs/</a></p><p><br></p><p><strong>Check out this AWS Global Accelerator Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-global-accelerator/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-global-accelerator/</a></p></div>"
    },
    {
        "questionNo": 37,
        "questionText": "A Solutions Architect is designing a monitoring application which generates audit logs of all operational activities of the company's cloud infrastructure. Their IT Security and Compliance team mandates that the application retain the logs for 5 years before the data can be deleted.\n\nHow can the Architect meet the above requirement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nStore the audit logs in a Glacier vault and use the Vault Lock feature.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nStore the audit logs in an EBS volume and then take EBS snapshots every month."
            },
            {
                "isCorrect": false,
                "text": "​\n\nStore the audit logs in an Amazon S3 bucket and enable Multi-Factor Authentication Delete (MFA Delete) on the S3 bucket."
            },
            {
                "isCorrect": false,
                "text": "​\n\nStore the audit logs in an EFS volume and use Network File System version 4 (NFSv4) file-locking mechanism."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>An Amazon S3 Glacier (Glacier) vault can have one resource-based vault access policy and one Vault Lock policy attached to it. A <em>Vault Lock policy</em> is a vault access policy that you can lock. Using a Vault Lock policy can help you enforce regulatory and compliance requirements. Amazon S3 Glacier provides a set of API operations for you to manage the Vault Lock policies.</p><p><br></p><p><img src=\"https://media.amazonwebservices.com/blog/2015/glacier_lock_policy_4.png\"></p><p><br></p><p>As an example of a Vault Lock policy, suppose that you are required to retain archives for one year before you can delete them. To implement this requirement, you can create a Vault Lock policy that denies users permissions to delete an archive until the archive has existed for one year. You can test this policy before locking it down. After you lock the policy, the policy becomes immutable. For more information about the locking process, see Amazon S3 Glacier Vault Lock. If you want to manage other user permissions that can be changed, you can use the vault access policy</p><p>Amazon S3 Glacier supports the following archive operations: Upload, Download, and Delete. Archives are immutable and cannot be modified. Hence, the correct answer is to <strong>store the audit logs in a Glacier vault and use the Vault Lock feature</strong>.</p><p><strong>Storing the audit logs in an EBS volume and then taking EBS snapshots every month</strong> is incorrect because this is not a suitable and secure solution. Anyone who has access to the EBS Volume can simply delete and modify the audit logs. Snapshots can be deleted too.</p><p><strong>Storing the audit logs in an Amazon S3 bucket and enabling Multi-Factor Authentication Delete (MFA Delete) on the S3 bucket</strong> is incorrect because this would still not meet the requirement. If someone has access to the S3 bucket and also has the proper MFA privileges then the audit logs can be edited.</p><p><strong>Storing the audit logs in an EFS volume and using Network File System version 4 (NFSv4) file-locking mechanism</strong> is incorrect because the data integrity of the audit logs can still be compromised if it is stored in an EFS volume with Network File System version 4 (NFSv4) file-locking mechanism and hence, not suitable as storage for the files. Although it will provide some sort of security, the file lock can still be overridden and the audit logs might be edited by someone else.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/amazonglacier/latest/dev/vault-lock.html\">https://docs.aws.amazon.com/amazonglacier/latest/dev/vault-lock.html</a></p><p><a href=\"https://docs.aws.amazon.com/amazonglacier/latest/dev/vault-lock-policy.html\">https://docs.aws.amazon.com/amazonglacier/latest/dev/vault-lock-policy.html</a></p><p><a href=\"https://aws.amazon.com/blogs/aws/glacier-vault-lock/\">https://aws.amazon.com/blogs/aws/glacier-vault-lock/</a></p><p><br></p><p><strong>Check out this Amazon S3 Glacier Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-glacier/?src=udemy\">https://tutorialsdojo.com/amazon-glacier/</a></p></div>"
    },
    {
        "questionNo": 38,
        "questionText": "You are a Solutions Architect for a large London-based software company. You are assigned to improve the performance and current processes of supporting the AWS resources in your VPC. Upon checking, you noticed that the Operations team does not have an automated way to monitor and resolve issues with their on-demand EC2 instances.\n\nWhat can be used to automatically monitor your EC2 instances and notify the Operations team for any incidents?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nAmazon CloudWatch\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SWF"
            },
            {
                "isCorrect": false,
                "text": "​\nAWS Cloudtrail"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SQS"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>Amazon CloudWatch</strong> is a monitoring service for AWS cloud resources and the applications you run on AWS. You can use Amazon CloudWatch to collect and track metrics, collect and monitor log files, and set alarms.</p><p>Amazon CloudWatch can monitor AWS resources such as Amazon EC2 instances, Amazon DynamoDB tables, and Amazon RDS DB instances, as well as custom metrics generated by your applications and services, and any log files your applications generate. You can use Amazon CloudWatch to gain system-wide visibility into resource utilization, application performance, and operational health. You can use these insights to react and keep your application running smoothly.</p><p><strong>AWS CloudTrail</strong> is incorrect as this is mainly used for logging and not for monitoring.</p><p><strong>Amazon SWF</strong> and <strong>Amazon SQS</strong> are incorrect as both are used for creating distributed application with decoupled components and not for monitoring.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://aws.amazon.com/cloudwatch/faqs/\">https://aws.amazon.com/cloudwatch/faqs/</a></p><p><br></p><p><strong>Check out this Amazon CloudWatch Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/</a></p></div>"
    },
    {
        "questionNo": 39,
        "questionText": "You are working for a tech company which currently has an on-premises infrastructure. They are currently running low on storage and want to have the ability to extend their storage using AWS cloud.\n\nWhich AWS service can help you achieve this requirement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\nAmazon Storage Gateway\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon Elastic Block Storage"
            },
            {
                "isCorrect": false,
                "text": "​\nAmazon SQS"
            },
            {
                "isCorrect": false,
                "text": "​\nAmazon EC2"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>AWS Storage Gateway connects an on-premises software appliance with cloud-based storage to provide seamless integration with data security features between your on-premises IT environment and the AWS storage infrastructure. You can use the service to store data in the AWS Cloud for scalable and cost-effective storage that helps maintain data security.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/storagegateway/latest/userguide/images/aws-storage-gateway-stored-diagram.png\"></p><p><br></p><p><strong>Amazon EC2</strong> is incorrect since this is a compute service, not a storage service.</p><p><strong>Amazon Elastic Block Storage</strong> is incorrect since EBS is primarily used as a storage of your EC2 instances.</p><p><strong>Amazon SQS</strong> is incorrect since this is a message queuing service, and does not extend your on-premises storage capacity.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"http://docs.aws.amazon.com/storagegateway/latest/userguide/WhatIsStorageGateway.html\">http://docs.aws.amazon.com/storagegateway/latest/userguide/WhatIsStorageGateway.html</a></p><p><br></p><p><strong>Check out this AWS Storage Gateway Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-storage-gateway/?src=udemy\">https://tutorialsdojo.com/aws-storage-gateway/</a></p><p><br></p><p><strong>Tutorials Dojo's AWS Certified Solutions Architect Associate Exam Study Guide:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-certified-solutions-architect-associate/?src=udemy\">https://tutorialsdojo.com/aws-certified-solutions-architect-associate/</a></p></div>"
    },
    {
        "questionNo": 40,
        "questionText": "Your company has a two-tier environment in its on-premises data center which is composed of an application tier and database tier. You are instructed to migrate their environment to the AWS cloud, and to design the subnets in their VPC with the following requirements:\n\na) There is an application load balancer that would distribute the incoming traffic among the servers in the application tier.\n\nb) The application tier and the database tier must not be accessible from the public Internet. The application tier should only accept traffic coming from the load balancer.\n\nc) The database tier contains very sensitive data. It must not share the same subnet with other AWS resources and its custom route table with other instances in the environment.\n\nd) The environment must be highly available and scalable to handle a surge of incoming traffic over the Internet.\n\n\n\n\nHow many subnets should you create to meet the above requirements?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\n3"
            },
            {
                "isCorrect": false,
                "text": "​\n\n4"
            },
            {
                "isCorrect": true,
                "text": "​\n\n6\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\n2"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>The given scenario indicated 4 requirements that should be met in order to successfully migrate their two-tier environment from their on-premises data center to AWS Cloud. The first requirement means that you have to use an application load balancer (ALB) to distribute the incoming traffic to your application servers.</p><p>The second requirement specifies that both your application and database tier should not be accessible from the public Internet. This means that you could create a single private subnet for both of your application and database tier. However, the third requirement mentioned that the database tier should not share the same subnet with other AWS resources to protect its sensitive data. This means that you should provision one private subnet for your application tier and another private subnet for your database tier.</p><p>The last requirement alludes to the need for using at least two Availability Zones to achieve high availability. This means that you have to distribute your application servers to two AZs as well as your database which can be set up with a master-slave configuration to properly replicate the data between two zones.</p><p>If you have more than one private subnet in the same Availability Zone that contains instances that need to be registered with the load balancer, you only need to create one public subnet. You need only one public subnet per Availability Zone; you can add the private instances in all the private subnets that reside in that particular Availability Zone.</p><p><img src=\"https://i.udemycdn.com/redactor/raw/2019-11-15_05-21-05-c823048b82f65f434901a13b2ecdbfce.png\"></p><p>Since you have a public internet-facing load balancer that has a group of backend Amazon EC2 instances that are deployed in a private subnet, you must create the corresponding public subnets in the <strong>same</strong> Availability Zones. This new public subnet is on top of the private subnet that is used by your private EC2 instances. Lastly, you should associate these public subnets to the internet-facing load balancer to complete the setup.</p><p>To summarize, we need to have one private subnet for the application tier and another one for the database tier. We then need to create another public subnet in the same Availability Zone where the private EC2 instances are hosted, in order to properly connect the public Internet-facing load balancer to your instances. This means that we have to use a total of 3 subnets consisting of 2 private subnets and 1 public subnet.</p><p>To meet the requirement of high availability, we have to deploy the stack to two Availability Zones. This means that you have to double the number of subnets you are using. Take note as well that you must create the corresponding public subnet in the same Availability Zone of your private EC2 servers in order for it to properly communicate with the load balancer.</p><p>Hence, the correct answer is 6 subnets.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Scenario2.html\">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Scenario2.html</a></p><p><a href=\"https://aws.amazon.com/premiumsupport/knowledge-center/public-load-balancer-private-ec2/\">https://aws.amazon.com/premiumsupport/knowledge-center/public-load-balancer-private-ec2/</a></p><p><br></p><p><strong>Check out this Amazon VPC Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-vpc/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-vpc/</a></p></div>"
    },
    {
        "questionNo": 41,
        "questionText": "A financial firm is designing an application architecture for its online trading platform that must have high availability and fault tolerance. Their Solutions Architect configured the application to use an Amazon S3 bucket located in the us-east-1 region to store large amounts of intraday financial data. The stored financial data in the bucket must not be affected even if there is an outage in one of the Availability Zones or if there's a regional service failure.\n\nWhat should the Architect do to avoid any costly service disruptions and ensure data durability?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nEnable Cross-Region Replication.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a new S3 bucket in another region and configure Cross-Account Access to the bucket located in us-east-1."
            },
            {
                "isCorrect": false,
                "text": "​\nCopy the S3 bucket to an EBS-backed EC2 instance."
            },
            {
                "isCorrect": false,
                "text": "​\nCreate a Lifecycle Policy to regularly backup the S3 bucket to Amazon Glacier."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>In this scenario, you need to enable Cross-Region Replication to ensure that your S3 bucket would not be affected even if there is an outage in one of the Availability Zones or a regional service failure in us-east-1. When you upload your data in S3, your objects are redundantly stored on multiple devices across multiple facilities within the region only, where you created the bucket. Thus, if there is an outage on the entire region, your S3 bucket will be unavailable if you do not enable Cross-Region Replication, which should make your data available to another region.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/product-marketing/S3/S3_Replication_Diagram.7860a04edc2ba93d290ffb9a21a9718574dc08e4.jpg\"></p><p><br></p><p>Note that an Availability Zone (AZ) is more related with Amazon EC2 instances rather than Amazon S3 so if there is any outage in the AZ, the S3 bucket is usually not affected but only the EC2 instances deployed on that zone.</p><p>Hence, the correct answer is: <strong><em>Enable Cross-Region Replication</em>.</strong></p><p>The option that says: <strong><em>Copy the S3 bucket to an EBS-backed EC2 instance</em></strong><em> </em>is incorrect because EBS is not as durable as Amazon S3. Moreover, if the Availability Zone where the volume is hosted goes down then the data will also be inaccessible.</p><p>The option that says: <strong><em>Create a Lifecycle Policy to regularly backup the S3 bucket to Amazon Glacier</em></strong> is incorrect because Glacier is primarily used for data archival. You also need to replicate your data to another region for better durability.</p><p>The option that says: <strong><em>Create a new S3 bucket in another region and configure Cross-Account Access to the bucket located in us-east-1</em></strong><em> </em>is incorrect because Cross-Account Access in Amazon S3 is primarily used if you want to grant access to your objects to another AWS account, and not just to another AWS Region. For example, Account <code>MANILA</code> can grant another AWS account (Account <code>CEBU)</code> permission to access its resources such as buckets and objects. S3 Cross-Account Access does not replicate data from one region to another. A better solution is to enable Cross-Region Replication (CRR) instead.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/s3/faqs/\">https://aws.amazon.com/s3/faqs/</a></p><p><a href=\"https://aws.amazon.com/s3/features/replication/\">https://aws.amazon.com/s3/features/replication/</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p></div>"
    },
    {
        "questionNo": 42,
        "questionText": "An organization plans to use an AWS Direct Connect connection to establish a dedicated connection between its on-premises network and AWS. The organization needs to launch a fully managed solution that will automate and accelerate the replication of data to and from various AWS storage services.\n\nWhich of the following solutions would you recommend?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nUse an AWS Storage Gateway file gateway to store and retrieve files directly using the SMB file system protocol."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse an AWS DataSync agent to rapidly move the data over the Internet."
            },
            {
                "isCorrect": true,
                "text": "​\n\nUse an AWS DataSync agent to rapidly move the data over a service endpoint.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse an AWS Storage Gateway tape gateway to store data on virtual tape cartridges and asynchronously copy your backups to AWS."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>AWS DataSync</strong> allows you to copy large datasets with millions of files, without having to build custom solutions with open source tools or license and manage expensive commercial network acceleration software. You can use DataSync to migrate active data to AWS, transfer data to the cloud for analysis and processing, archive data to free up on-premises storage capacity, or replicate data to AWS for business continuity.</p><p>AWS DataSync simplifies, automates, and accelerates copying large amounts of data to and from AWS storage services over the internet or AWS Direct Connect. DataSync can copy data between Network File System (NFS), Server Message Block (SMB) file servers, self-managed object storage, or AWS Snowcone, and Amazon Simple Storage Service (Amazon S3) buckets, Amazon EFS file systems, and Amazon FSx for Windows File Server file systems.</p><p><img src=\"https://d1.awsstatic.com/cloud-storage/AWS-DataSync-How-it-Works-Diagram.d27ec6f14be8ca9c2d434f94dd4a98c3fdf5c88c.png\"></p><p>You deploy an AWS DataSync agent to your on-premises hypervisor or in Amazon EC2. To copy data to or from an on-premises file server, you download the agent virtual machine image from the AWS Console and deploy to your on-premises VMware ESXi, Linux Kernel-based Virtual Machine (KVM), or Microsoft Hyper-V hypervisor. To copy data to or from an in-cloud file server, you create an Amazon EC2 instance using a DataSync agent AMI. In both cases the agent must be deployed so that it can access your file server using the NFS, SMB protocol, or the Amazon S3 API. To set up transfers between your AWS Snowcone device and AWS storage, use the DataSync agent AMI that comes pre-installed on your device.</p><p>Since the scenario plans to use AWS Direct Connect for private connectivity between on-premises and AWS, you can use DataSync to automate and accelerate online data transfers to AWS storage services. The AWS DataSync agent will be deployed in your on-premises network to accelerate data transfer to AWS. To connect programmatically to an AWS service, you will need to use an AWS Direct Connect service endpoint.<br></p><p>Hence, the correct answer is: <strong>Use an AWS DataSync agent to rapidly move the data over a service endpoint</strong>.</p><p>The option that says: <strong>Use AWS DataSync agent to rapidly move the data over the Internet</strong> is incorrect because the organization will be using an AWS Direct Connect connection for private connectivity. This means that the connection will not pass through the public Internet.</p><p>The options that say: <strong>Use AWS Storage Gateway tape gateway to store data on virtual tape cartridges and asynchronously copy your backups to AWS </strong>and <strong>Use AWS Storage Gateway file gateway to store and retrieve files directly using the SMB file system protocol</strong> are both incorrect because, in the scenario, you need to accelerate the replication of data, and not establish a hybrid cloud storage architecture. AWS Storage Gateway only supports a few AWS storage services as a target based on the type of gateway that you launched. AWS DataSync is more suitable in automating and accelerating online data transfers to a variety of AWS storage services.<br></p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/datasync/faqs/\">https://aws.amazon.com/datasync/faqs/</a></p><p><a href=\"https://docs.aws.amazon.com/datasync/latest/userguide/what-is-datasync.html\">https://docs.aws.amazon.com/datasync/latest/userguide/what-is-datasync.html</a></p><p><a href=\"https://docs.aws.amazon.com/general/latest/gr/dc.html\">https://docs.aws.amazon.com/general/latest/gr/dc.html</a></p><p><br></p><p><strong>Check out this AWS DataSync Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-datasync/?src=udemy\">https://tutorialsdojo.com/aws-datasync/</a></p></div>"
    },
    {
        "questionNo": 43,
        "questionText": "A newly hired Solutions Architect is checking all of the security groups and network access control list rules of the company's AWS resources. For security purposes, the MS SQL connection via port 1433 of the database tier should be secured. Below is the security group configuration of their Microsoft SQL Server database:\n\n\n\n\nLarger image\n\n\n\n\nThe application tier hosted in an Auto Scaling group of EC2 instances is the only identified resource that needs to connect to the database. The Architect should ensure that the architecture complies with the best practice of granting least privilege.\n\nWhich of the following changes should be made to the security group configuration?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nFor the MS SQL rule, change the Source to the security group ID attached to the application tier.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nFor the MS SQL rule, change the Source to the static AnyCast IP address attached to the application tier."
            },
            {
                "isCorrect": false,
                "text": "​\n\nFor the MS SQL rule, change the Source to the Network ACL ID attached to the application tier."
            },
            {
                "isCorrect": false,
                "text": "​\n\nFor the MS SQL rule, change the Source to the EC2 instance IDs of the underlying instances of the Auto Scaling group."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>A <strong>security group</strong> acts as a virtual firewall for your instance to control inbound and outbound traffic. When you launch an instance in a VPC, you can assign up to five security groups to the instance. Security groups act at the instance level, not the subnet level. Therefore, each instance in a subnet in your VPC can be assigned to a different set of security groups.</p><p>If you launch an instance using the Amazon EC2 API or a command line tool and you don't specify a security group, the instance is automatically assigned to the default security group for the VPC. If you launch an instance using the Amazon EC2 console, you have an option to create a new security group for the instance.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2020-01-11_09-55-33-102a3438068e9bb4c45fa670155c2044.png\"></p><p><br></p><p>For each security group, you add <em>rules</em> that control the inbound traffic to instances, and a separate set of rules that control the outbound traffic. This section describes the basic things that you need to know about security groups for your VPC and their rules.</p><p>Amazon security groups and network ACLs don't filter traffic to or from link-local addresses (<code>169.254.0.0/16</code>) or AWS reserved IPv4 addresses (these are the first four IPv4 addresses of the subnet, including the Amazon DNS server address for the VPC). Similarly, flow logs do not capture IP traffic to or from these addresses.</p><p>In the scenario, the security group configuration allows any server (0.0.0.0/0) from anywhere to establish an MS SQL connection to the database via the 1433 port. The most suitable solution here is to change the <code><strong>Source</strong></code> field to the security group ID attached to the application tier.</p><p>Hence, the correct answer is the option that says: <strong>For the MS SQL rule, change the </strong><code><strong>Source</strong></code><strong> to the security group ID attached to the application tier</strong>.</p><p>The option that says: <strong>For the MS SQL rule, change the </strong><code><strong>Source</strong></code><strong> to the EC2 instance IDs of the underlying instances of the Auto Scaling group</strong> is incorrect because using the EC2 instance IDs of the underlying instances of the Auto Scaling group as the source can cause intermittent issues. New instances will be added and old instances will be removed from the Auto Scaling group over time, which means that you have to manually update the security group setting once again. A better solution is to use the security group ID of the Auto Scaling group of EC2 instances.</p><p>The option that says: <strong>For the MS SQL rule, change the </strong><code><strong>Source</strong></code><strong> to the static AnyCast IP address attached to the application tier</strong> is incorrect because a static AnyCast IP address is primarily used for AWS Global Accelerator and not for security group configurations.</p><p>The option that says: <strong>For the MS SQL rule, change the </strong><code><strong>Source</strong></code><strong> to the Network ACL ID attached to the application tier</strong> is incorrect because you have to use the security group ID instead of the Network ACL ID of the application tier. Take note that the Network ACL covers the entire subnet which means that other applications that use the same subnet will also be affected.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html\">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html</a></p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Security.html\">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Security.html</a></p></div>"
    },
    {
        "questionNo": 44,
        "questionText": "There are a few, easily reproducible but confidential files that your client wants to store in AWS without worrying about storage capacity. For the first month, all of these files will be accessed frequently but after that, they will rarely be accessed at all. The old files will only be accessed by developers so there is no set retrieval time requirement. However, the files under a specific tutorialsdojo-finance prefix in the S3 bucket will be used for post-processing that requires millisecond retrieval time.\n\nGiven these conditions, which of the following options would be the most cost-effective solution for your client's storage needs?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nStore the files in S3 then after a month, change the storage class of the bucket to S3-IA using lifecycle policy."
            },
            {
                "isCorrect": false,
                "text": "​\n\nStore the files in S3 then after a month, change the storage class of the tutorialsdojo-finance prefix to S3-IA while the remaining go to Glacier using lifecycle policy."
            },
            {
                "isCorrect": true,
                "text": "​\n\nStore the files in S3 then after a month, change the storage class of the tutorialsdojo-finance prefix to One Zone-IA while the remaining go to Glacier using lifecycle policy.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nStore the files in S3 then after a month, change the storage class of the bucket to Intelligent-Tiering using lifecycle policy."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Initially, the files will be accessed frequently, and S3 is a durable and highly available storage solution for that. After a month has passed, the files won't be accessed frequently anymore, so it is a good idea to use lifecycle policies to move them to a storage class that would have a lower cost for storing them.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/images/SupportedTransitionsWaterfallModel.png\"></p><p><br></p><p>Since the files are easily reproducible and some of them are needed to be retrieved quickly based on a specific prefix filter (<code>tutorialsdojo-finance</code>), S3-One Zone IA would be a good choice for storing them. The other files that do not contain such prefix would then be moved to Glacier for low cost archival. This setup would also be the most cost-effective for the client.</p><p>Hence, the correct answer is to <strong>store the files in S3 then after a month, change the storage class of the </strong><code><strong>tutorialsdojo-finance</strong></code><strong> prefix to One Zone-IA while the remaining go to Glacier using lifecycle policy</strong>.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2019-04-02_04-26-21-158b6e1eb7ef7be3b91049e88f056f3a.gif\"></p><p><br></p><p><strong>Storing the files in S3 then after a month, changing the storage class of the bucket to S3-IA using lifecycle policy</strong> is incorrect because although it is valid to move the files to S3-IA, this solution still costs more compared with using a combination of S3-One Zone IA and Glacier.</p><p><strong>Storing the files in S3 then after a month, changing the storage class of the bucket to Intelligent-Tiering using lifecycle policy</strong> is incorrect because while S3 Intelligent-Tiering can automatically move data between two access tiers (frequent access and infrequent access) when access patterns change, it is more suitable for scenarios where you don't know the access patterns of your data. It may take some time for S3 Intellgent-Tiering to analyze the access patterns before it moves the data to a cheaper storage class like S3-IA which means you may still end up paying more in the beginning. In addition, you already know the access patterns of the files which means you can directly change the storage class immediately and save cost right away.</p><p><strong>Storing the files in S3 then after a month, changing the storage class of the </strong><code><strong>tutorialsdojo-finance</strong></code><strong> prefix to S3-IA while the remaining go to Glacier using lifecycle policy</strong> is incorrect because although S3-IA costs less than S3 Standard storage class, it is still more expensive than S3-One Zone IA. Remember that the files are easily reproducible so you can safely move the data to S3-One Zone IA and in case there is an outage, you can simply generate the missing data again.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/blogs/compute/amazon-s3-adds-prefix-and-suffix-filters-for-lambda-function-triggering\">https://aws.amazon.com/blogs/compute/amazon-s3-adds-prefix-and-suffix-filters-for-lambda-function-triggering</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lifecycle-mgmt.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lifecycle-mgmt.html</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/lifecycle-configuration-examples.html\">https://docs.aws.amazon.com/AmazonS3/latest/dev/lifecycle-configuration-examples.html</a></p><p><a href=\"https://aws.amazon.com/s3/pricing\">https://aws.amazon.com/s3/pricing</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p></div>"
    },
    {
        "questionNo": 45,
        "questionText": "There is a new compliance rule in your company that audits every Windows and Linux EC2 instances each month to view any performance issues. They have more than a hundred EC2 instances running in production, and each must have a logging function that collects various system details regarding that instance. The SysOps team will periodically review these logs and analyze their contents using AWS Analytics tools, and the result will need to be retained in an S3 bucket.\n\nIn this scenario, what is the most efficient way to collect and analyze logs from the instances with minimal effort?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nInstall AWS Inspector Agent in each instance which will collect and push data to CloudWatch Logs periodically. Set up a CloudWatch dashboard to properly analyze the log data of all instances."
            },
            {
                "isCorrect": false,
                "text": "​\n\nInstall the AWS Systems Manager Agent (SSM Agent) in each instance which will automatically collect and push data to CloudWatch Logs. Analyze the log data with CloudWatch Logs Insights."
            },
            {
                "isCorrect": false,
                "text": "​\n\nInstall AWS SDK in each instance and create a custom daemon script that would collect and push data to CloudWatch Logs periodically. Enable CloudWatch detailed monitoring and use CloudWatch Logs Insights to analyze the log data of all instances."
            },
            {
                "isCorrect": true,
                "text": "​\n\nInstall the unified CloudWatch Logs agent in each instance which will automatically collect and push data to CloudWatch Logs. Analyze the log data with CloudWatch Logs Insights.\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>To collect logs from your Amazon EC2 instances and on-premises servers into CloudWatch Logs, AWS offers both a new unified CloudWatch agent, and an older CloudWatch Logs agent. It is recommended to use the unified CloudWatch agent which has the following advantages:</p><p>- You can collect both logs and advanced metrics with the installation and configuration of just one agent.</p><p>- The unified agent enables the collection of logs from servers running Windows Server.</p><p>- If you are using the agent to collect CloudWatch metrics, the unified agent also enables the collection of additional system metrics, for in-guest visibility.</p><p>- The unified agent provides better performance.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/product-marketing/cloudwatch/Product%20Page%20Diagrams/LogsInsights-workflow.0d4b31f451e7cc4dc05e2b40240bcd0d178f1283.png\"></p><p><br></p><p>CloudWatch Logs Insights enables you to interactively search and analyze your log data in Amazon CloudWatch Logs. You can perform queries to help you quickly and effectively respond to operational issues. If an issue occurs, you can use CloudWatch Logs Insights to identify potential causes and validate deployed fixes.</p><p>CloudWatch Logs Insights includes a purpose-built query language with a few simple but powerful commands. CloudWatch Logs Insights provides sample queries, command descriptions, query autocompletion, and log field discovery to help you get started quickly. Sample queries are included for several types of AWS service logs.</p><p>The option that says: <strong>Install AWS SDK in each instance and create a custom daemon script that would collect and push data to CloudWatch Logs periodically. Enable CloudWatch detailed monitoring and use CloudWatch Logs Insights to analyze the log data of all instances</strong> is incorrect. Although this is a valid solution, this entails a lot of effort to implement as you have to allocate time to install the AWS SDK to each instance and develop a custom monitoring solution. Remember that the question is specifically looking for a solution that can be implemented with minimal effort. In addition, it is unnecessary and not cost-efficient to enable detailed monitoring in CloudWatch in order to meet the requirements of this scenario since this can be done using CloudWatch Logs.</p><p>The option that says: <strong>Install the AWS Systems Manager Agent (SSM Agent) in each instance which will automatically collect and push data to CloudWatch Logs. Analyze the log data with CloudWatch Logs Insights</strong> is incorrect as although this is also a valid solution, it is more efficient to use CloudWatch agent than an SSM agent. Manually connecting to an instance to view log files and troubleshoot an issue with SSM Agent is time-consuming hence, for more efficient instance monitoring, you can use the CloudWatch Agent instead to send the log data to Amazon CloudWatch Logs.</p><p>The option that says: <strong>Install AWS Inspector Agent in each instance which will collect and push data to CloudWatch Logs periodically. Set up a CloudWatch dashboard to properly analyze the log data of all instances</strong> is incorrect because AWS Inspector is simply a security assessments service which only helps you in checking for unintended network accessibility of your EC2 instances and for vulnerabilities on those EC2 instances. Furthermore, setting up an Amazon CloudWatch dashboard is not suitable since its primarily used for scenarios where you have to monitor your resources in a single view, even those resources that are spread across different AWS Regions. It is better to use CloudWatch Logs Insights instead since it enables you to interactively search and analyze your log data.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/WhatIsCloudWatchLogs.html\">https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/WhatIsCloudWatchLogs.html</a></p><p><a href=\"https://docs.aws.amazon.com/systems-manager/latest/userguide/monitoring-ssm-agent.html\">https://docs.aws.amazon.com/systems-manager/latest/userguide/monitoring-ssm-agent.html</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/AnalyzingLogData.html\">https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/AnalyzingLogData.html</a></p><p><br></p><p><strong>Check out this Amazon CloudWatch Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-cloudwatch/?src=udemy\">https://tutorialsdojo.com/amazon-cloudwatch/</a></p><p><br></p><p><strong>Additional learning material:</strong> CloudWatch Logs Insights Customer Use Case</p><p><br></p><p><strong>CloudWatch Agent vs SSM Agent vs Custom Daemon Scripts:</strong></p><p><a href=\"https://tutorialsdojo.com/cloudwatch-agent-vs-ssm-agent-vs-custom-daemon-scripts/?src=udemy\">https://tutorialsdojo.com/cloudwatch-agent-vs-ssm-agent-vs-custom-daemon-scripts/</a></p></div>"
    },
    {
        "questionNo": 46,
        "questionText": "A data analytics company, which uses machine learning to collect and analyze consumer data, is using Redshift cluster as their data warehouse. You are instructed to implement a disaster recovery plan for their systems to ensure business continuity even in the event of an AWS region outage.   \n\nWhich of the following is the best approach to meet this requirement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nEnable Cross-Region Snapshots Copy in your Amazon Redshift Cluster.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nDo nothing because Amazon Redshift is a highly available, fully-managed data warehouse which can withstand an outage of an entire AWS region."
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a scheduled job that will automatically take the snapshot of your Redshift Cluster and store it to an S3 bucket. Restore the snapshot in case of an AWS region outage."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse Automated snapshots of your Redshift Cluster."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can configure Amazon Redshift to copy snapshots for a cluster to another region. To configure cross-region snapshot copy, you need to enable this copy feature for each cluster and configure where to copy snapshots and how long to keep copied automated snapshots in the destination region. When cross-region copy is enabled for a cluster, all new manual and automatic snapshots are copied to the specified region.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/redshift/latest/mgmt/images/rs-mgmt-restore-table-from-snapshot.png\"></p><p><br></p><p>The option that says: <strong>Create a scheduled job that will automatically take the snapshot of your Redshift Cluster and store it to an S3 bucket. Restore the snapshot in case of an AWS region outage</strong> is incorrect because although this option is possible, this entails a lot of manual work and hence, not the best option. You should configure cross-region snapshot copy instead.</p><p>The option that says: <strong>Do nothing because Amazon Redshift is a highly available, fully-managed data warehouse which can withstand an outage of an entire AWS region</strong> is incorrect because although Amazon Redshift is a fully-managed data warehouse, you will still need to configure cross-region snapshot copy to ensure that your data is properly replicated to another region.</p><p><strong>Using Automated snapshots of your Redshift Cluster</strong> is incorrect because using automated snapshots is not enough and will not be available in case the entire AWS region is down.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/redshift/latest/mgmt/managing-snapshots-console.html\">https://docs.aws.amazon.com/redshift/latest/mgmt/managing-snapshots-console.html</a></p><p><br></p><p><strong>Check out this Amazon Redshift Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-redshift/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-redshift/</a></p></div>"
    },
    {
        "questionNo": 47,
        "questionText": "A data analytics company has been building its new generation big data and analytics platform on their AWS cloud infrastructure. They need a storage service that provides the scale and performance that their big data applications require such as high throughput to compute nodes coupled with read-after-write consistency and low-latency file operations. In addition, their data needs to be stored redundantly across multiple AZs and allows concurrent connections from multiple EC2 instances hosted on multiple AZs.   \n\nWhich of the following AWS storage services will you use to meet this requirement?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nGlacier"
            },
            {
                "isCorrect": true,
                "text": "​\n\nEFS\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nS3"
            },
            {
                "isCorrect": false,
                "text": "​\n\nEBS"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>In this question, you should take note of the two keywords/phrases: \"file operation\" and \"allows concurrent connections from multiple EC2 instances\". There are various AWS storage options that you can choose but whenever these criteria show up, always consider using EFS instead of using EBS Volumes which is mainly used as a \"block\" storage and can only have one connection to one EC2 instance at a time. Amazon EFS provides the scale and performance required for big data applications that require high throughput to compute nodes coupled with read-after-write consistency and low-latency file operations.</p><p><strong>Amazon EFS</strong> is a fully-managed service that makes it easy to set up and scale file storage in the Amazon Cloud. With a few clicks in the AWS Management Console, you can create file systems that are accessible to Amazon EC2 instances via a file system interface (using standard operating system file I/O APIs) and supports full file system access semantics (such as strong consistency and file locking).</p><p>Amazon EFS file systems can automatically scale from gigabytes to petabytes of data without needing to provision storage. Tens, hundreds, or even thousands of Amazon EC2 instances can access an Amazon EFS file system at the same time, and Amazon EFS provides consistent performance to each Amazon EC2 instance. Amazon EFS is designed to be highly durable and highly available.</p><p><strong>EBS</strong> is incorrect because it does not allow concurrent connections from multiple EC2 instances hosted on multiple AZs and it does not store data redundantly across multiple AZs by default, unlike EFS.</p><p><strong>S3</strong> is incorrect because although it can handle concurrent connections from multiple EC2 instances, it does not have the ability to provide low-latency file operations, which is required in this scenario.</p><p><strong>Glacier</strong> is incorrect because this is an archiving storage solution and is not applicable in this scenario.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/efs/latest/ug/performance.html\">https://docs.aws.amazon.com/efs/latest/ug/performance.html</a></p><p><a href=\"https://aws.amazon.com/efs/faq/\">https://aws.amazon.com/efs/faq/</a></p><p><br></p><p><strong>Check out this Amazon EFS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-efs/?src=udemy\">https://tutorialsdojo.com/amazon-efs/</a></p><p><br></p><p><strong>Check out this Amazon S3 vs EBS vs EFS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-s3-vs-ebs-vs-efs/?src=udemy\">https://tutorialsdojo.com/amazon-s3-vs-ebs-vs-efs/</a></p><p><br></p><p><strong>Here's a short video tutorial on Amazon EFS:</strong></p><p><a href=\"https://youtu.be/AvgAozsfCrY\">https://youtu.be/AvgAozsfCrY</a></p></div>"
    },
    {
        "questionNo": 48,
        "questionText": "A financial company instructed you to automate the recurring tasks in your department such as patch management, infrastructure selection, and data synchronization to improve their current processes. You need to have a service which can coordinate multiple AWS services into serverless workflows.   \n\nWhich of the following is the most cost-effective service to use in this scenario?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nAWS Step Functions\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS Batch"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS Lambda"
            },
            {
                "isCorrect": false,
                "text": "​\n\nSWF"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>AWS Step Functions</strong> provides serverless orchestration for modern applications. Orchestration centrally manages a workflow by breaking it into multiple steps, adding flow logic, and tracking the inputs and outputs between the steps. As your applications execute, Step Functions maintains application state, tracking exactly which workflow step your application is in, and stores an event log of data that is passed between application components. That means that if networks fail or components hang, your application can pick up right where it left off.</p><p>Application development is faster and more intuitive with Step Functions, because you can define and manage the workflow of your application independently from its business logic. Making changes to one does not affect the other. You can easily update and modify workflows in one place, without having to struggle with managing, monitoring and maintaining multiple point-to-point integrations. Step Functions frees your functions and containers from excess code, so your applications are faster to write, more resilient, and easier to maintain.</p><p><strong>SWF</strong> is incorrect because this is a fully-managed state tracker and task coordinator service. It does not provide serverless orchestration to multiple AWS resources.</p><p><strong>AWS Lambda</strong> is incorrect because although Lambda is used for serverless computing, it does not provide a direct way to coordinate multiple AWS services into serverless workflows.</p><p><strong>AWS Batch</strong> is incorrect because this is primarily used to efficiently run hundreds of thousands of batch computing jobs in AWS.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://aws.amazon.com/step-functions/features/\">https://aws.amazon.com/step-functions/features/</a></p><p><br></p><p><strong>Check out this AWS Step Functions Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-step-functions/\"><strong>https://tutorialsdojo.com/aws-cheat-sheet-aws-step-functions/</strong></a></p><p><br></p><p><strong>Amazon Simple Workflow (SWF) vs AWS Step Functions vs Amazon SQS:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-simple-workflow-swf-vs-aws-step-functions-vs-amazon-sqs/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-simple-workflow-swf-vs-aws-step-functions-vs-amazon-sqs/</a></p><p><br></p><p><strong>Comparison of AWS Services Cheat Sheets:</strong></p><p><a href=\"https://tutorialsdojo.com/comparison-of-aws-services-for-udemy-students/\">https://tutorialsdojo.com/comparison-of-aws-services-for-udemy-students/</a></p></div>"
    },
    {
        "questionNo": 49,
        "questionText": "You are working as a Solutions Architect for a financial firm which is building an internal application that processes loans, accruals, and interest rates for their clients. They require a storage service that is able to handle future increases in storage capacity of up to 16 TB and can provide the lowest-latency access to their data. Their web application will be hosted in a single m5ad.24xlarge Reserved EC2 instance which will process and store data to the storage service.\n\nWhich of the following would be the most suitable storage service that you should use to meet this requirement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nEBS\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nStorage Gateway"
            },
            {
                "isCorrect": false,
                "text": "​\n\nS3"
            },
            {
                "isCorrect": false,
                "text": "​\n\nEFS"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon Web Services (AWS) offers cloud storage services to support a wide range of storage workloads such as Amazon S3, EFS and EBS. Amazon EFS is a file storage service for use with Amazon EC2. Amazon EFS provides a file system interface, file system access semantics (such as strong consistency and file locking), and concurrently-accessible storage for up to thousands of Amazon EC2 instances. Amazon S3 is an object storage service. Amazon S3 makes data available through an Internet API that can be accessed anywhere. Amazon EBS is a block-level storage service for use with Amazon EC2. Amazon EBS can deliver performance for workloads that require the <strong>lowest-latency access to data</strong> from a single EC2 instance. You can also increase EBS storage for up to 16TB or add new volumes for additional storage.</p><p>In this scenario, the company is looking for a storage service which can provide the lowest-latency access to their data which will be fetched by a single m5ad.24xlarge Reserved EC2 instance. This type of workloads can be supported better by using either EFS or EBS but in this case, the latter is the most suitable storage service. As mentioned above, EBS provides the <em>lowest-latency</em> access to the data for your EC2 instance since the volume is directly attached to the instance. In addition, the scenario does not require concurrently-accessible storage since they only have one instance.</p><p>Hence, the correct answer is <strong>EBS</strong>.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2019-01-27_08-08-30-95c0c6fa077cd4d2c0dc4dd23c98ef09.png\"></p><p><br></p><p><strong>Storage Gateway</strong> is incorrect since this is primarily used to extend your on-premises storage to your AWS Cloud.</p><p><strong>S3</strong> is incorrect because although this is also highly available and highly scalable, it still does not provide the lowest-latency access to the data, unlike EBS. Remember that S3 does not reside within your VPC by default, which means the data will traverse the public Internet that may result to higher latency. You can set up a VPC Endpoint for S3 yet still, its latency is greater than that of EBS.</p><p><strong>EFS</strong> is incorrect because the scenario does not require concurrently-accessible storage since the internal application is only hosted in one instance. Although EFS can provide low latency data access to the EC2 instance as compared with S3, the storage service that can provide the lowest latency access is still EBS.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/ebs/\">https://aws.amazon.com/ebs/</a></p><p><a href=\"https://aws.amazon.com/efs/faq/\">https://aws.amazon.com/efs/faq/</a></p><p><br></p><p><strong>Check out this Amazon EBS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-ebs/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-ebs/</a></p></div>"
    },
    {
        "questionNo": 50,
        "questionText": "You have a distributed application in AWS that periodically processes large volumes of data across multiple instances. You designed the application to recover gracefully from any instance failures. You are required to launch the application in the most cost-effective way.\n\nWhich type of EC2 instance will meet your requirements?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nDedicated instances"
            },
            {
                "isCorrect": false,
                "text": "​\nReserved instances"
            },
            {
                "isCorrect": true,
                "text": "​\nSpot Instances\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nOn-Demand instances"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You require an EC2 instance that is the most cost-effective among other types. In addition, the application it will host is designed to gracefully recover in case of instance failures.</p><p>In terms of cost-effectiveness, Spot and Reserved instances are the top options. And since the application can gracefully recover from instance failures, the Spot instance is the best option for this case as it is the cheapest type of EC2 instance. Remember that when you use Spot Instances, there will be interruptions. Amazon EC2 can interrupt your Spot Instance when the Spot price exceeds your maximum price, when the demand for Spot Instances rise, or when the supply of Spot Instances decreases. This makes <strong>Spot Instances</strong> the correct answer.</p><p><strong>Reserved instances</strong> is incorrect because although you could also use reserved instances to save costs, it entails a commitment of 1-year or 3-year terms of usage. Since your processes only run periodically, you won't be able to maximize the discounted price of using reserved instances.</p><p><strong>Dedicated instances</strong> and <strong>On-Demand instances</strong> are also incorrect because Dedicated and on-demand instances are not a cost-effective solution to use for your application.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/how-spot-instances-work.html\">http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/how-spot-instances-work.html</a></p><p><br></p><p><strong>Check out this Amazon EC2 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/</a></p><p><br></p><p><strong>Here is an in-depth look at Spot Instances:</strong></p><p><a href=\"https://youtu.be/PKvss-RgSjI\">https://youtu.be/PKvss-RgSjI</a></p></div>"
    },
    {
        "questionNo": 51,
        "questionText": "To save cost, a company decided to change their third-party data analytics tool to a cheaper solution. They sent a full data export on a CSV file which contains all of their analytics information. You then save the CSV file to an S3 bucket for storage. Your manager asked you to do some validation on the provided data export. \n\nIn this scenario, what is the most cost-effective and easiest way to analyze export data using a standard SQL?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nTo be able to run SQL queries, use AWS Athena to analyze the export data file in S3.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse a migration tool to load the CSV export file from S3 to a database which is designed for online analytic processing (OLAP) such as AWS RedShift. Run some queries once the data has been loaded to complete your validation."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse mysqldump client utility to load the CSV export file from S3 to a MySQL RDS instance. Run some SQL queries once the data has been loaded to complete your validation."
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a migration tool to load the CSV export file from S3 to a DynamoDB instance. Once the data has been loaded, run queries using DynamoDB."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon Athena is an interactive query service that makes it easy to analyze data directly in Amazon Simple Storage Service (Amazon S3) using standard SQL. With a few actions in the AWS Management Console, you can point Athena at your data stored in Amazon S3 and begin using standard SQL to run ad-hoc queries and get results in seconds.</p><p>Athena is serverless, so there is no infrastructure to set up or manage, and you pay only for the queries you run. Athena scales automatically—executing queries in parallel—so results are fast, even with large datasets and complex queries.</p><p>Athena helps you analyze unstructured, semi-structured, and structured data stored in Amazon S3. Examples include CSV, JSON, or columnar data formats such as Apache Parquet and Apache ORC. You can use Athena to run ad-hoc queries using ANSI SQL, without the need to aggregate or load the data into Athena.</p><p>Hence, the most cost-effective and appropriate answer in this scenario is the option that says: <strong>To be able to run SQL queries, use Amazon Athena to analyze the export data file in S3.</strong></p><p>The rest of the options are all incorrect because it is not necessary to set up a database to be able to analyze the CSV export file. You can use a cost-effective option (AWS Athena), which is a serverless service that enables you to pay only for the queries you run.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/athena/latest/ug/what-is.html\">https://docs.aws.amazon.com/athena/latest/ug/what-is.html</a></p><p><br></p><p><strong>Check out this Amazon Athena Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-athena/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-athena/</a></p></div>"
    },
    {
        "questionNo": 52,
        "questionText": "A leading IT consulting company has an application which processes a large stream of financial data by an Amazon ECS Cluster then stores the result to a DynamoDB table. You have to design a solution to detect new entries in the DynamoDB table then automatically trigger a Lambda function to run some tests to verify the processed data.\n\nWhat solution can be easily implemented to alert the Lambda function of new entries while requiring minimal configuration change to your architecture?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nUse Systems Manager Automation to detect new entries in the DynamoDB table then automatically invoke the Lambda function for processing."
            },
            {
                "isCorrect": false,
                "text": "​\n\nInvoke the Lambda functions using SNS each time that the ECS Cluster successfully processed financial data."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse CloudWatch Alarms to trigger the Lambda function whenever a new entry is created in the DynamoDB table."
            },
            {
                "isCorrect": true,
                "text": "​\n\nEnable DynamoDB Streams to capture table activity and automatically trigger the Lambda function.\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon DynamoDB is integrated with AWS Lambda so that you can create <em>triggers</em>—pieces of code that automatically respond to events in DynamoDB Streams. With triggers, you can build applications that react to data modifications in DynamoDB tables.</p><p>If you enable DynamoDB Streams on a table, you can associate the stream ARN with a Lambda function that you write. Immediately after an item in the table is modified, a new record appears in the table's stream. AWS Lambda polls the stream and invokes your Lambda function synchronously when it detects new stream records.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/images/StreamsAndTriggers.png\"></p><p><br></p><p>You can create a Lambda function which can perform a specific action that you specify, such as sending a notification or initiating a workflow. For instance, you can set up a Lambda function to simply copy each stream record to persistent storage, such as EFS or S3, to create a permanent audit trail of write activity in your table.</p><p>Suppose you have a mobile gaming app that writes to a <code>TutorialsDojoCourses</code> table. Whenever the <code>TopCourse</code> attribute of the <code>TutorialsDojoScores</code> table is updated, a corresponding stream record is written to the table's stream. This event could then trigger a Lambda function that posts a congratulatory message on a social media network. (The function would simply ignore any stream records that are not updates to <code>TutorialsDojoCourses</code> or that do not modify the <code>TopCourse</code> attribute.)</p><p>Hence, <strong>enabling DynamoDB Streams to capture table activity and automatically trigger the Lambda function</strong> is the correct answer because the requirement can be met with minimal configuration change using DynamoDB streams which can automatically trigger Lambda functions whenever there is a new entry.</p><p><strong>Using CloudWatch Alarms to trigger the Lambda function whenever a new entry is created in the DynamoDB table</strong> is incorrect because CloudWatch Alarms only monitor service metrics, not changes in DynamoDB table data.</p><p><strong>Invoking the Lambda functions using SNS each time that the ECS Cluster successfully processed financial data</strong> is incorrect because you don't need to create an SNS topic just to invoke Lambda functions. You can enable DynamoDB streams instead to meet the requirement with less configuration.</p><p><strong>Using Systems Manager Automation to detect new entries in the DynamoDB table then automatically invoking the Lambda function for processing</strong> is incorrect because the Systems Manager Automation service is primarily used to simplify common maintenance and deployment tasks of Amazon EC2 instances and other AWS resources. It does not have the capability to detect new entries in a DynamoDB table.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/Streams.Lambda.html\">https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/Streams.Lambda.html</a></p><p><a href=\"https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/Streams.html\">https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/Streams.html</a></p><p><br></p><p><strong>Check out this Amazon DynamoDB cheat sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-dynamodb/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-dynamodb/</a></p></div>"
    },
    {
        "questionNo": 53,
        "questionText": "You are managing a global news website which is deployed to AWS and is using MySQL RDS. The website has millions of viewers from all over the world which means that the website has read-heavy database workloads. All database transactions must be ACID compliant to ensure data integrity.\n\nIn this scenario, which of the following is the best option to use to increase the read throughput on the MySQL database?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nEnable Multi-AZ deployments"
            },
            {
                "isCorrect": false,
                "text": "​\nEnable Amazon RDS Standby Replicas"
            },
            {
                "isCorrect": false,
                "text": "​\nUse SQS to queue up the requests"
            },
            {
                "isCorrect": true,
                "text": "​\nEnable Amazon RDS Read Replicas\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Amazon RDS Read Replicas provide enhanced performance and durability for database (DB) instances. This feature makes it easy to elastically scale out beyond the capacity constraints of a single DB instance for read-heavy database workloads. You can create one or more replicas of a given source DB Instance and serve high-volume application read traffic from multiple copies of your data, thereby increasing aggregate read throughput. Read replicas can also be promoted when needed to become standalone DB instances. Read replicas are available in Amazon RDS for MySQL, MariaDB, Oracle and PostgreSQL as well as Amazon Aurora.</p><p><br></p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/887309d048beef83ad3eabf2a79a64a389ab1c9f/2016/09/14/MySQLConnector.png\"></p><p><br></p><p><strong>Enabling Multi-AZ deployments</strong> is incorrect because the Multi-AZ deployments feature is mainly used to achieve high availability and failover support for your database.</p><p><strong>Enabling Amazon RDS Standby Replicas</strong> is incorrect because a Standby replica is used in Multi-AZ deployments and hence, it is not a solution to reduce read-heavy database workloads.</p><p><strong>Using SQS to queue up the requests</strong> is incorrect because although an SQS queue can effectively manage the requests, it won't be able to entirely improve the read-throughput of the database by itself.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/rds/details/read-replicas/\">https://aws.amazon.com/rds/details/read-replicas/</a></p><p><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_ReadRepl.html\">https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_ReadRepl.html</a></p><p><br></p><p><strong>Check out this Amazon RDS Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-relational-database-service-amazon-rds/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-relational-database-service-amazon-rds/</a></p><p><br></p><p><strong>Here is a quick introduction to Amazon RDS:</strong></p><p><a href=\"https://youtu.be/eMzCI7S1P9M\">https://youtu.be/eMzCI7S1P9M</a></p></div>"
    },
    {
        "questionNo": 54,
        "questionText": "You have a web application hosted in AWS cloud where the application logs are sent to Amazon CloudWatch. Lately, the web application has recently been encountering some errors which can be resolved simply by restarting the instance.\n\nWhat will you do to automatically restart the EC2 instances whenever the same application error occurs?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nFirst, look at the existing Flow logs for keywords related to the application error to create a custom metric. Then, create a CloudWatch alarm for that custom metric which calls a Lambda function that invokes an action to restart the EC2 instance."
            },
            {
                "isCorrect": true,
                "text": "​\nFirst, look at the existing CloudWatch logs for keywords related to the application error to create a custom metric. Then, create a CloudWatch alarm for that custom metric which invokes an action to restart the EC2 instance.\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nFirst, look at the existing Flow logs for keywords related to the application error to create a custom metric. Then, create a CloudWatch alarm for that custom metric which invokes an action to restart the EC2 instance."
            },
            {
                "isCorrect": false,
                "text": "​\nFirst, look at the existing CloudWatch logs for keywords related to the application error to create a custom metric. Then, create an alarm in Amazon SNS for that custom metric which invokes an action to restart the EC2 instance."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>In this scenario, you can look at the existing CloudWatch logs for keywords related to the application error to create a custom metric. Then, create a CloudWatch alarm for that custom metric which invokes an action to restart the EC2 instance.</p><p>You can create alarms that automatically stop, terminate, reboot, or recover your EC2 instances using Amazon CloudWatch alarm actions. You can use the stop or terminate actions to help you save money when you no longer need an instance to be running. You can use the reboot and recover actions to automatically reboot those instances or recover them onto new hardware if a system impairment occurs.</p><p>The option that says: <strong>First, look at the existing CloudWatch logs for keywords related to the application error to create a custom metric. Then, create an alarm in Amazon SNS for that custom metric which invokes an action to restart the EC2 instance</strong> is incorrect because you can't create an alarm in Amazon SNS.</p><p>The options that say: <strong>First, look at the existing Flow logs for keywords related to the application error to create a custom metric. Then, create a CloudWatch alarm for that custom metric which invokes an action to restart the EC2 instance</strong> and <strong>First, look at the existing Flow logs for keywords related to the application error to create a custom metric. Then, create a CloudWatch alarm for that custom metric which calls a Lambda function that invokes an action to restart the EC2 instance</strong> are incorrect because Flow Logs are used in VPC and not on specific EC2 instance.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/UsingAlarmActions.html\">https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/UsingAlarmActions.html</a></p><p><br></p><p><strong>Check out this Amazon CloudWatch Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-cloudwatch/</a></p></div>"
    },
    {
        "questionNo": 55,
        "questionText": "To save costs, your manager instructed you to analyze and review the setup of your AWS cloud infrastructure. You should also provide an estimate of how much your company will pay for all of the AWS resources that they are using. In this scenario, which of the following will incur costs? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nPublic Data Set"
            },
            {
                "isCorrect": true,
                "text": "​\nEBS Volumes attached to stopped EC2 Instances\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nUsing an Amazon VPC"
            },
            {
                "isCorrect": false,
                "text": "​\n\nA stopped On-Demand EC2 Instance"
            },
            {
                "isCorrect": true,
                "text": "​\nA running EC2 Instance\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Billing commences when Amazon EC2 initiates the boot sequence of an AMI instance. Billing ends when the instance terminates, which could occur through a web services command, by running \"shutdown -h\", or through instance failure. When you stop an instance, AWS shuts it down but don't charge hourly usage for a stopped instance or data transfer fees, but AWS does charge for the storage of any Amazon EBS volumes.</p><p>Hence, <strong>a running EC2 Instance</strong> and <strong>EBS Volumes attached to stopped EC2 Instances</strong> are the right answers and conversely, <strong>a stopped On-Demand EC2 Instance</strong> is incorrect as there is no charge for a terminated EC2 instance that you have shut down.</p><p><strong>Using Amazon VPC</strong> is incorrect because there are no additional charges for creating and using the VPC itself. Usage charges for other Amazon Web Services, including Amazon EC2, still apply at published rates for those resources, including data transfer charges.</p><p><strong>Public Data Set</strong> is incorrect due to the fact that Amazon stores the data sets at no charge to the community and, as with all AWS services, you pay only for the compute and storage you use for your own applications.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/cloudtrail/\">https://aws.amazon.com/cloudtrail/</a></p><p><a href=\"https://aws.amazon.com/vpc/faqs\">https://aws.amazon.com/vpc/faqs</a></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-public-data-sets.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-public-data-sets.html</a></p><p><br></p><p><strong>Check out this Amazon EC2 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/</a></p></div>"
    },
    {
        "questionNo": 56,
        "questionText": "A Fortune 500 company which has numerous offices and customers around the globe has hired you as their Principal Architect. You have staff and customers that upload gigabytes to terabytes of data to a centralized S3 bucket from the regional data centers, across continents, all over the world on a regular basis. At the end of the financial year, there are thousands of data being uploaded to the central S3 bucket which is in ap-southeast-2 (Sydney) region and a lot of employees are starting to complain about the slow upload times. You were instructed by the CTO to resolve this issue as soon as possible to avoid any delays in processing their global end of financial year (EOFY) reports.   \n\nWhich feature in Amazon S3 enables fast, easy, and secure transfer of your files over long distances between your client and your Amazon S3 bucket?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nMultipart Upload"
            },
            {
                "isCorrect": false,
                "text": "​\nCross-Region Replication"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS Global Accelerator"
            },
            {
                "isCorrect": true,
                "text": "​\nTransfer Acceleration\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>Amazon S3 Transfer Acceleration</strong> enables fast, easy, and secure transfer of files over long distances between your client and your Amazon S3 bucket. Transfer Acceleration leverages Amazon CloudFront's globally distributed AWS Edge Locations. As data arrives at an AWS Edge Location, data is routed to your Amazon S3 bucket over an optimized network path.</p><p><br></p><p><img src=\"https://udemy-images.s3.amazonaws.com/redactor/raw/2020-01-05_10-40-22-9f9d508726b9e9828a384a704259745e.png\"></p><p><br></p><p>Amazon S3 Transfer Acceleration can speed up content transfers to and from Amazon S3 by as much as 50-500% for long-distance transfer of larger objects. Customers who have either web or mobile applications with widespread users or applications hosted far away from their S3 bucket can experience long and variable upload and download speeds over the Internet. S3 Transfer Acceleration (S3TA) reduces the variability in Internet routing, congestion and speeds that can affect transfers, and logically shortens the distance to S3 for remote applications. S3TA improves transfer performance by routing traffic through Amazon CloudFront’s globally distributed Edge Locations and over AWS backbone networks, and by using network protocol optimizations.</p><p>Hence, <strong>Transfer Acceleration</strong> is the correct answer.</p><p><strong>AWS Global Accelerator</strong> is incorrect because this service is primarily used to optimize the path from your users to your applications which improves the performance of your TCP and UDP traffic. Using Amazon S3 Transfer Acceleration is a more suitable service for this scenario.</p><p><strong>Cross-Region Replication</strong> is incorrect because this simply enables you to automatically copy S3 objects from one bucket to another bucket that is placed in a different AWS Region or within the same Region.</p><p><strong>Multipart Upload</strong> is incorrect because this feature simply allows you to upload a single object as a set of parts. You can upload these object parts independently and in any order. If transmission of any part fails, you can retransmit that part without affecting other parts. After all parts of your object are uploaded, Amazon S3 assembles these parts and creates the object. In general, when your object size reaches 100 MB, you should consider using multipart uploads instead of uploading the object in a single operation.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/s3/faqs/\">https://aws.amazon.com/s3/faqs/</a></p><p><a href=\"https://aws.amazon.com/s3/transfer-acceleration/\">https://aws.amazon.com/s3/transfer-acceleration/</a></p><p><br></p><p><strong>Check out this Amazon S3 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-s3/</a></p></div>"
    },
    {
        "questionNo": 57,
        "questionText": "You are working as a  Solutions Architect for a major supermarket store chain. They have an e-commerce application which is running in eu-east-2 region that strictly requires six EC2 instances running at all times. In that region, there are 3 Availability Zones (AZ) - eu-east-2a, eu-east-2b, and eu-east-2c that you can use.\n\nWhich of the following deployments provide 100% fault tolerance if any single AZ in the region becomes unavailable? (Select TWO.)",
        "options": [
            {
                "isCorrect": false,
                "text": "​\neu-east-2a with two EC2 instances, eu-east-2b with two EC2 instances, and eu-east-2c with two EC2 instances"
            },
            {
                "isCorrect": true,
                "text": "​\neu-east-2a with six EC2 instances, eu-east-2b with six EC2 instances, and eu-east-2c with no EC2 instances\n(Correct)"
            },
            {
                "isCorrect": true,
                "text": "​\neu-east-2a with three EC2 instances, eu-east-2b with three EC2 instances, and eu-east-2c with three EC2 instances\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\neu-east-2a with four EC2 instances, eu-east-2b with two EC2 instances, and eu-east-2c with two EC2 instances"
            },
            {
                "isCorrect": false,
                "text": "​\n\neu-east-2a with two EC2 instances, eu-east-2b with four EC2 instances, and eu-east-2c with two EC2 instances"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Fault Tolerance is the ability of a system to remain in operation even if some of the components used to build the system fail. In AWS, this means that in the event of server fault or system failures, the number of running EC2 instance should not fall below the minimum number of instances required by the system for it to work properly. So if the application requires a minimum of 6 instances, there should be at least 6 instances running in case there is an outage in one of the Availability Zones or if there are server issues.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/images/tutorial_as_elb_architecture.png\"></p><p><br></p><p>In this scenario, you have to simulate a situation where one Availability Zone became unavailable for each option and check whether it still has 6 running instances.</p><p>Hence, the correct answers are: <strong><em>eu-east-2a with six EC2 instances, eu-east-2b with six EC2 instances, and eu-east-2c with no EC2 instances</em></strong><em> </em>and<em> </em><strong><em>eu-east-2a with three EC2 instances, eu-east-2b with three EC2 instances, and eu-east-2c with three EC2 instances</em></strong> because even if there is an outage in one of the Availability Zones, there are still 6 running instances:</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://media.amazonwebservices.com/AWS_Building_Fault_Tolerant_Applications.pdf\">https://media.amazonwebservices.com/AWS_Building_Fault_Tolerant_Applications.pdf</a></p></div>"
    },
    {
        "questionNo": 58,
        "questionText": "You have a requirement to integrate the Lightweight Directory Access Protocol (LDAP) directory service of your on-premises data center to your AWS VPC using IAM. The identity store which is currently being used is not compatible with SAML.   \n\nWhich of the following provides the most valid approach to implement the integration?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\nUse IAM roles to rotate the IAM credentials whenever LDAP credentials are updated."
            },
            {
                "isCorrect": false,
                "text": "​\n\nUse AWS Single Sign-On (SSO) service to enable single sign-on between AWS and your LDAP."
            },
            {
                "isCorrect": true,
                "text": "​\n\nDevelop an on-premises custom identity broker application and use STS to issue short-lived AWS credentials.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nUse an IAM policy that references the LDAP identifiers and AWS credentials."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>If your identity store is not compatible with SAML 2.0, then you can build a custom identity broker application to perform a similar function. The broker application authenticates users, requests temporary credentials for users from AWS, and then provides them to the user to access AWS resources.</p><p>The application verifies that employees are signed into the existing corporate network's identity and authentication system, which might use LDAP, Active Directory, or another system. The identity broker application then obtains temporary security credentials for the employees.</p><p>To get temporary security credentials, the identity broker application calls either <code><strong>AssumeRole</strong></code> or <code><strong>GetFederationToken</strong></code> to obtain temporary security credentials, depending on how you want to manage the policies for users and when the temporary credentials should expire. The call returns temporary security credentials consisting of an AWS access key ID, a secret access key, and a session token. The identity broker application makes these temporary security credentials available to the internal company application. The app can then use the temporary credentials to make calls to AWS directly. The app caches the credentials until they expire, and then requests a new set of temporary credentials.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/images/enterprise-authentication-with-identity-broker-application.diagram.png\"></p><p><br></p><p><strong>Using an IAM policy that references the LDAP identifiers and AWS credentials</strong> is incorrect because using an IAM policy is not enough to integrate your LDAP service to IAM. You need to use SAML, STS or a custom identity broker.</p><p><strong>Using AWS Single Sign-On (SSO) service to enable single sign-on between AWS and your LDAP</strong> is incorrect because the scenario did not require SSO and in addition, the identity store that you are using is not SAML-compatible.</p><p><strong>Using IAM roles to rotate the IAM credentials whenever LDAP credentials are updated</strong> is incorrect because manually rotating the IAM credentials is not an optimal solution to integrate your on-premises and VPC network. You need to use SAML, STS or a custom identity broker.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_common-scenarios_federated-users.html\">https://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_common-scenarios_federated-users.html</a></p><p><a href=\"https://aws.amazon.com/blogs/aws/aws-identity-and-access-management-now-with-identity-federation/\">https://aws.amazon.com/blogs/aws/aws-identity-and-access-management-now-with-identity-federation/</a></p></div>"
    },
    {
        "questionNo": 59,
        "questionText": "You recently launched a new FTP server using an On-Demand EC2 instance in a newly created VPC with default settings. The server should not be accessible publicly but only through your IP address 175.45.116.100 and nowhere else.\n\nWhich of the following is the most suitable way to implement this requirement?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nCreate a new Network ACL inbound rule in the subnet of the EC2 instance with the following details:\n\nProtocol: UDP\n\nPort Range: 20 - 21\n\nSource: 175.45.116.100/0\n\nAllow/Deny: ALLOW"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a new inbound rule in the security group of the EC2 instance with the following details:\n\nProtocol: UDP\n\nPort Range: 20 - 21\n\nSource: 175.45.116.100/32"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCreate a new Network ACL inbound rule in the subnet of the EC2 instance with the following details:\n\nProtocol: TCP\n\nPort Range: 20 - 21\n\nSource: 175.45.116.100/0\n\nAllow/Deny: ALLOW"
            },
            {
                "isCorrect": true,
                "text": "​\n\nCreate a new inbound rule in the security group of the EC2 instance with the following details:\n\nProtocol: TCP\n\nPort Range: 20 - 21\n\nSource: 175.45.116.100/32\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>The FTP protocol uses TCP via ports 20 and 21. This should be configured in your security groups or in your Network ACL inbound rules. As required by the scenario, you should only allow the individual IP of the client and not the entire network. Therefore, in the <strong>Source, </strong>the proper CIDR notation should be used. The <strong>/32</strong> denotes one IP address and the <strong>/0</strong> refers to the entire network.</p><p>Notice that the scenario says that you launched the EC2 instances in a newly created VPC with default settings. Your VPC automatically comes with a modifiable default network ACL. By default, it allows all inbound and outbound IPv4 traffic and, if applicable, IPv6 traffic. Hence, you actually don't need to explicitly add inbound rules to your Network ACL to allow inbound traffic, if your VPC has a default setting.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/vpc/latest/userguide/images/security-diagram.png\"></p><p><br></p><p>The below option is incorrect because although the configuration of the Security Group is valid, the provided Protocol is incorrect. Take note that FTP uses TCP and not UDP.</p><p><strong>Create a new inbound rule in the security group of the EC2 instance with the following details:</strong></p><p><strong>Protocol: UDP</strong></p><p><strong>Port Range: 20 - 21</strong></p><p><strong>Source: </strong><code><strong>175.45.116.100/32</strong></code></p><p><br></p><p>The below option is incorrect because although setting up an inbound Network ACL is valid, the source is invalid since it must be an IPv4 or IPv6 CIDR block. In the provided IP address, the <strong>/0</strong> refers to the entire network and not a specific IP address. In addition, the scenario says that the newly created VPC has default settings and by default, the Network ACL allows all traffic. This means that there is actually no need to configure your Network ACL.</p><p><strong>Create a new Network ACL inbound rule in the subnet of the EC2 instance with the following details:</strong></p><p><strong>Protocol: TCP</strong></p><p><strong>Port Range: 20 - 21</strong></p><p><strong>Source: </strong><code><strong>175.45.116.100/0</strong></code></p><p><strong>Allow/Deny: ALLOW</strong></p><p><br></p><p>The below option is incorrect because, just like Option 3, the source is also invalid. Take note that FTP uses TCP and not UDP, which is one of the reasons why this option is wrong. In addition, the scenario says that the newly created VPC has default settings and by default, the Network ACL allows all traffic. This means that there is actually no need to configure your Network ACL.</p><p><strong>Create a new Network ACL inbound rule in the subnet of the EC2 instance with the following details:</strong></p><p><strong>Protocol: UDP</strong></p><p><strong>Port Range: 20 - 21</strong></p><p><strong>Source: </strong><code><strong>175.45.116.100/0</strong></code></p><p><strong>Allow/Deny: ALLOW</strong></p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html\">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html</a></p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/vpc-network-acls.html\">https://docs.aws.amazon.com/vpc/latest/userguide/vpc-network-acls.html</a></p><p><br></p><p><strong>Check out this Amazon VPC Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/amazon-vpc/?src=udemy\">https://tutorialsdojo.com/amazon-vpc/</a></p></div>"
    },
    {
        "questionNo": 60,
        "questionText": "You have a web application hosted in an On-Demand EC2 instance in your VPC. You are creating a shell script that needs the instance's public and private IP addresses.\n\nWhat is the best way to get the instance's associated IP addresses which your shell script can use?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nBy using a CloudWatch metric."
            },
            {
                "isCorrect": true,
                "text": "​\nBy using a Curl or Get Command to get the latest metadata information from http://169.254.169.254/latest/meta-data/\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\nBy using IAM."
            },
            {
                "isCorrect": false,
                "text": "​\nBy using a Curl or Get Command to get the latest user data information from http://169.254.169.254/latest/user-data/"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>Instance metadata is data about your EC2 instance that you can use to configure or manage the running instance. Because your instance metadata is available from your running instance, you do not need to use the Amazon EC2 console or the AWS CLI. This can be helpful when you're writing scripts to run from your instance. For example, you can access the local IP address of your instance from instance metadata to manage a connection to an external application.</p><p>To view the private IPv4 address, public IPv4 address, and all other categories of instance metadata from within a running instance, use the following URL:</p><pre class=\"prettyprint linenums\">http://169.254.169.254/latest/meta-data/</pre><p><br></p><p><strong>Reference:</strong></p><p><a href=\"http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-instance-metadata.html\">http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-instance-metadata.html</a></p><p><br></p><p><strong>Check out this Amazon EC2 Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-elastic-compute-cloud-amazon-ec2/</a></p></div>"
    },
    {
        "questionNo": 61,
        "questionText": "An application is using a RESTful API hosted in AWS which uses Amazon API Gateway and AWS Lambda. There is a requirement to trace and analyze user requests as they travel through your Amazon API Gateway APIs to the underlying services. \n\nWhich of the following is the most suitable service to use to meet this requirement?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nAWS X-Ray\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCloudWatch"
            },
            {
                "isCorrect": false,
                "text": "​\n\nVPC Flow Logs"
            },
            {
                "isCorrect": false,
                "text": "​\n\nCloudTrail"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>You can use <a href=\"https://docs.aws.amazon.com/xray/latest/devguide/xray-services-apigateway.html\">AWS X-Ray</a> to trace and analyze user requests as they travel through your Amazon API Gateway APIs to the underlying services. API Gateway supports AWS X-Ray tracing for all API Gateway endpoint types: regional, edge-optimized, and private. You can use AWS X-Ray with Amazon API Gateway in all regions where X-Ray is available.</p><p>X-Ray gives you an end-to-end view of an entire request, so you can analyze latencies in your APIs and their backend services. You can use an X-Ray service map to view the latency of an entire request and that of the downstream services that are integrated with X-Ray. And you can configure sampling rules to tell X-Ray which requests to record, at what sampling rates, according to criteria that you specify. If you call an API Gateway API from a service that's already being traced, API Gateway passes the trace through, even if X-Ray tracing is not enabled on the API.</p><p>You can enable X-Ray for an API stage by using the API Gateway management console, or by using the API Gateway API or CLI.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/apigateway/latest/developerguide/images/apigateway-xray-traceview-1.png\"></p><p><br></p><p><strong><em>VPC Flow Logs</em></strong> is incorrect because this is a feature that enables you to capture information about the IP traffic going to and from network interfaces in your entire VPC. Although it can capture some details about the incoming user requests, it is still better to use AWS X-Ray as it provides a better way to debug and analyze your microservices applications with request tracing so you can find the root cause of your issues and performance.</p><p><strong><em>CloudWatch</em></strong> is incorrect because this is a monitoring and management service. It does not have the capability to trace and analyze user requests as they travel through your Amazon API Gateway APIs.</p><p><strong><em>CloudTrail</em></strong> is incorrect because this is primarily used for IT audits and API logging of all of your AWS resources. It does not have the capability to trace and analyze user requests as they travel through your Amazon API Gateway APIs, unlike AWS X-Ray.</p><p><br></p><p><strong>Reference:</strong></p><p><a href=\"https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-xray.html\">https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-xray.html</a></p><p><br></p><p><strong>Check out this AWS X-Ray Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-aws-x-ray/\">https://tutorialsdojo.com/aws-cheat-sheet-aws-x-ray/</a></p><p><br></p><p><strong>Instrumenting your Application with AWS X-Ray:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-instrumenting-your-application-with-aws-x-ray/\">https://tutorialsdojo.com/aws-cheat-sheet-instrumenting-your-application-with-aws-x-ray/</a></p></div>"
    },
    {
        "questionNo": 62,
        "questionText": "The company you are working for has a set of AWS resources hosted in ap-northeast-1 region. You have been asked by your IT Manager to create an AWS CLI shell script that will call an AWS service which could create duplicate resources in another region in the event that ap-northeast-1 region fails. The duplicated resources should also contain the VPC Peering configuration and other networking components from the primary stack.\n\nWhich of the following AWS services could help fulfill this task?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SQS"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon LightSail"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon SNS"
            },
            {
                "isCorrect": true,
                "text": "​\n\nAWS CloudFormation\n\n(Correct)"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p>AWS CloudFormation is a service that helps you model and set up your Amazon Web Services resources so that you can spend less time managing those resources and more time focusing on your applications that run in AWS.</p><p><br></p><p><img src=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/images/designer-jsoneditor.png\"></p><p><br></p><p>You can create a template that describes all the AWS resources that you want (like Amazon EC2 instances or Amazon RDS DB instances), and AWS CloudFormation takes care of provisioning and configuring those resources for you. With this, you can deploy an exact copy of your AWS architecture, along with all of the AWS resources which are hosted in one region to another.</p><p>Hence, the correct answer is <strong>AWS CloudFormation</strong>.</p><p><strong>Amazon LightSail</strong> is incorrect because you can't use this to duplicate your resources in your VPC. You have to use CloudFormation instead.</p><p><strong>Amazon SQS</strong> and <strong>Amazon SNS</strong> are both incorrect because SNS and SQS are just messaging services.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/Welcome.html\">https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/Welcome.html</a></p><p><a href=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/using-cfn-cli-creating-stack.html\">https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/using-cfn-cli-creating-stack.html</a></p><p><br></p><p><strong>Check out this AWS CloudFormation Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cloudformation/?src=udemy\">https://tutorialsdojo.com/aws-cloudformation/</a></p></div>"
    },
    {
        "questionNo": 63,
        "questionText": "A data analytics application requires a service that can collect, process, and analyze clickstream data from various websites in real-time. Which of the following is the most suitable service to use for the application?",
        "options": [
            {
                "isCorrect": false,
                "text": "​\n\nRedshift Spectrum"
            },
            {
                "isCorrect": true,
                "text": "​\nKinesis\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAmazon EMR with Compute Optimized Instances"
            },
            {
                "isCorrect": false,
                "text": "​\n\nAWS Glue"
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>Amazon Kinesis</strong> makes it easy to collect, process, and analyze real-time, streaming data so you can get timely insights and react quickly to new information. Amazon Kinesis offers key capabilities to cost-effectively process streaming data at any scale, along with the flexibility to choose the tools that best suit the requirements of your application. With Amazon Kinesis, you can ingest real-time data such as video, audio, application logs, website clickstreams, and IoT telemetry data for machine learning, analytics, and other applications. Amazon Kinesis enables you to process and analyze data as it arrives and responds instantly instead of having to wait until all your data is collected before the processing can begin.</p><p><br></p><p><img src=\"https://d1.awsstatic.com/Products/product-name/diagrams/product-page-diagram_Amazon-Kinesis_Evolve-from-batch-to-real-time-Analytics.d7ed76be304a30be5720fd159469f157e7c09ede.png\"></p><p><br></p><p><strong>Redshift Spectrum</strong> is incorrect because this is primarily used to directly query open data formats stored in Amazon S3 without the need for unnecessary data movement, which enables you to analyze data across your data warehouse and data lake, together, with a single service. It does not provide the ability to process your data in real-time, unlike Kinesis.</p><p><strong>AWS Glue</strong> is incorrect because this is a fully managed extract, transform, and load (ETL) service that makes it easy for customers to prepare and load their data for analytics. It does not provide the ability to process your data in real-time, unlike Kinesis.</p><p><strong>Amazon EMR with Compute Optimized Instances</strong> is incorrect because this is a web service that uses an open-source Hadoop framework to quickly &amp; cost-effectively process vast amounts of data. It does not provide the ability to process your data in real-time, unlike Kinesis. Compute-optimized instances are ideal for compute-bound applications that benefit from high-performance processors but not for analyzing clickstream data from various websites in real-time.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/kinesis/\">https://aws.amazon.com/kinesis/</a></p><p><a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/compute-optimized-instances.html\">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/compute-optimized-instances.html</a></p><p><br></p><p><strong>Check out this Amazon Kinesis Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-cheat-sheet-amazon-kinesis/\">https://tutorialsdojo.com/aws-cheat-sheet-amazon-kinesis/</a></p></div>"
    },
    {
        "questionNo": 64,
        "questionText": "A multinational company with multiple on-premises data centers around the globe is heavily using AWS to serve its clients worldwide. The company already has hundreds of VPCs with multiple VPN connections to their data centers that span to multiple AWS Regions. As the number of its workloads running on AWS grows, the company must be able to scale its networks across multiple accounts and Amazon VPCs to keep up. A Solutions Architect is tasked to interconnect all of the company's on-premises networks, VPNs, and VPCs into a single gateway, that includes support for inter-region peering across multiple AWS regions.\n\nWhich of the following is the BEST solution that the Architect should set up to support the required interconnectivity?",
        "options": [
            {
                "isCorrect": true,
                "text": "​\n\nSet up an AWS Transit Gateway to implement a hub-and-spoke network topology in each region that routes all traffic through a network transit center. Route traffic between VPCs and the on-premises data centers over AWS Site-to-Site VPNs.\n\n(Correct)"
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet up an AWS VPN CloudHub for inter-region VPC access and a Direct Connect gateway for the VPN connections to the on-premises data centers. Create a virtual private gateway in each VPC, then create a private virtual interface for each AWS Direct Connect connection to the Direct Connect gateway."
            },
            {
                "isCorrect": false,
                "text": "​\n\nSet up an AWS Direct Connect Gateway to achieve inter-region VPC access to all of the AWS resources and on-premises data centers. Set up a link aggregation group (LAG) to aggregate multiple connections at a single AWS Direct Connect endpoint in order to treat them as a single, managed connection. Launch a virtual private gateway in each VPC and then create a public virtual interface for each AWS Direct Connect connection to the Direct Connect Gateway."
            },
            {
                "isCorrect": false,
                "text": "​\n\nEnable inter-region VPC peering that allows peering relationships to be established between multiple VPCs across different AWS regions. Set up a networking configuration that ensures that the traffic will always stay on the global AWS backbone and never traverse the public Internet."
            }
        ],
        "explain": "<h4>Explanation</h4><div data-purpose=\"safely-set-inner-html:mc-quiz-question:question-explanation\"><p><strong>AWS Transit Gateway</strong> is a service that enables customers to connect their Amazon Virtual Private Clouds (VPCs) and their on-premises networks to a single gateway. As you grow the number of workloads running on AWS, you need to be able to scale your networks across multiple accounts and Amazon VPCs to keep up with the growth.</p><p>Today, you can connect pairs of Amazon VPCs using peering. However, managing point-to-point connectivity across many Amazon VPCs, without the ability to centrally manage the connectivity policies, can be operationally costly and cumbersome. For on-premises connectivity, you need to attach your AWS VPN to each individual Amazon VPC. This solution can be time-consuming to build and hard to manage when the number of VPCs grows into the hundreds.</p><p>With AWS Transit Gateway, you only have to create and manage a single connection from the central gateway to each Amazon VPC, on-premises data center, or remote office across your network. Transit Gateway acts as a hub that controls how traffic is routed among all the connected networks which act like spokes. This hub and spoke model significantly simplifies management and reduces operational costs because each network only has to connect to the Transit Gateway and not to every other network. Any new VPC is simply connected to the Transit Gateway and is then automatically available to every other network that is connected to the Transit Gateway. This ease of connectivity makes it easy to scale your network as you grow.</p><p><img src=\"https://d1.awsstatic.com/product-marketing/transit-gateway/tgw-after.d85d3e2cb67fd2ed1a3be645d443e9f5910409fd.png\"></p><p>It acts as a Regional virtual router for traffic flowing between your virtual private clouds (VPC) and VPN connections. A transit gateway scales elastically based on the volume of network traffic. Routing through a transit gateway operates at layer 3, where the packets are sent to a specific next-hop attachment, based on their destination IP addresses.</p><p>A transit gateway attachment is both a source and a destination of packets. You can attach the following resources to your transit gateway:</p><p>- One or more VPCs</p><p>- One or more VPN connections</p><p>- One or more AWS Direct Connect gateways</p><p>- One or more transit gateway peering connections</p><p>If you attach a transit gateway peering connection, the transit gateway must be in a different Region.</p><p>Hence, the correct answer is: <strong>Set up an AWS Transit Gateway to implement a hub-and-spoke network topology in each region that routes all traffic through a network transit center. Route traffic between VPCs and the on-premises data centers over AWS Site-to-Site VPNs.</strong></p><p>The option that says: <strong>Set up an AWS Direct Connect Gateway to achieve inter-region VPC access to all of the AWS resources and on-premises data centers. Set up a link aggregation group (LAG) to aggregate multiple connections at a single AWS Direct Connect endpoint in order to treat them as a single, managed connection. Launch a virtual private gateway in each VPC and then create a public virtual interface for each AWS Direct Connect connection to the Direct Connect Gateway</strong> is incorrect because you can only create a <strong>private</strong> virtual interface to a Direct Connect gateway and not a <strong>public</strong> virtual interface. Using a link aggregation group (LAG) is also irrelevant in this scenario because it is just a logical interface that uses the Link Aggregation Control Protocol (LACP) to aggregate multiple connections at a single AWS Direct Connect endpoint, allowing you to treat them as a single, managed connection.</p><p>The option that says: <strong>Enable inter-region VPC peering which allows peering relationships to be established between VPCs across different AWS regions. This will ensure that the traffic will always stay on the global AWS backbone and will never traverse the public Internet</strong> is incorrect because this solution would require a lot of manual setup and management overhead to successfully build a functional, error-free inter-region VPC network compared with just using a Transit Gateway. Although the Inter-Region VPC Peering provides a cost-effective way to share resources between regions or replicate data for geographic redundancy, its connections are not dedicated and highly available. Moreover, it doesn't support the company's on-premises data centers in multiple AWS Regions.</p><p>The option that says: <strong>Set up an AWS VPN CloudHub for inter-region VPC access and a Direct Connect gateway for the VPN connections to the on-premises data centers. Create a virtual private gateway in each VPC, then create a private virtual interface for each AWS Direct Connect connection to the Direct Connect gateway</strong> is incorrect because this solution doesn't meet the requirement of interconnecting all of the company's on-premises networks, VPNs, and VPCs into a <strong>single</strong> gateway, that includes support for inter-region peering across multiple AWS regions. As its name implies, the AWS VPN CloudHub is only for <strong>VPNs</strong> and not for VPCs. It is also not capable of managing hundreds of VPCs with multiple VPN connections to their data centers that span to multiple AWS Regions.</p><p><br></p><p><strong>References:</strong></p><p><a href=\"https://aws.amazon.com/transit-gateway/\">https://aws.amazon.com/transit-gateway/</a></p><p><a href=\"https://docs.aws.amazon.com/vpc/latest/tgw/how-transit-gateways-work.html\">https://docs.aws.amazon.com/vpc/latest/tgw/how-transit-gateways-work.html</a></p><p><br></p><p><strong>Check out this AWS Transit Gateway Cheat Sheet:</strong></p><p><a href=\"https://tutorialsdojo.com/aws-transit-gateway/?src=udemy\">https://tutorialsdojo.com/aws-transit-gateway/</a></p></div>"
    }
]